{
  "acura_ilx_2016": " Wanted to stay with Honda products, having been an owner of Honda or Acura since 1980.  Like the exterior styling of this car very much.  However, I have a spine condition and find the buckets are too deep and make my back hurt after 30 minutes.  Hate the hesitation with acceleration , feel like I'm driving a tank, but need to make allowances here since I am coming for a car that has 260 hp.  Wish I had gone for the Navi on upper level package because there is a stupid black screen behind the clock that is distracting.  The cabin feels claustrophobic and small.  The seating adjustments are not enough.  I'm trying to find a seat cushion to fix the bucket issue, but everything pushes my head into the headliner.  I've had this car for 3.5 weeks and am counting the days until I can sell it , get something else.  I've sat in every Honda and Acura product and only found 3 seats that were comfortable for my back...Honda Fit , HR-V, and Acura TLX.  Latter is too big and hated the push buttons (had those on my teenage car and not going back!), car also too big.  Fit is OK, but feels like I'm downgrading from old Acura.  HR-V was OK, but don't want an SUV.  Finishes on interiors of Honda , Acura products really cheaped out now.  Still looking for something to replace this Acura ILX.  SOOOOO very disappointed in Honda/Acura now.  Feeling really let down by this manufacturer.",
  "acura_ilx_2016": " My 2nd Acura to date and just like the previous one, it's been great. Excellent highway mileage of 39 mi/gallon and is not a slouch if you want speed. The car handle really well around corners and have a very good braking system. We currently have 6 Honda made products 2 Civic (2005 and 2007), 2 CRV (2009 and 2013), the Ilx, and a lawn mower and all have been super reliable. I place reliability above anything else and my experience with Honda cars have been excellent. Both Civicc and the 2009 CRV have way over 100k miles and not one ever had a single problem. I don't expect less from a Honda built automobile and I don't expect less from the Acura either.",
  "acura_ilx_2016": " **NOTE**  ILX not TLX -- I liked everything about this car except for a few items -. Hate the speech recognition system: doesn't recognize my commands, very inflexible command structure,. Cabin noise is to high with the premium tires, the navigation system is not compressive with current systems., even, no speed limit indication, messy to input destinations and 2nd waypoints. The good thing is Siri works well and does understand voice commands. Likes: snappy, 8 speed transmission is outstanding, Best reason to own are the electronic safety controls.  These take about 50% of the effort out of long distance driving.  Also getting 39 mpg on highway trips. Low roof for tall people",
  "acura_ilx_2016": " This car is great! The ride is snug and very quiet. The only major complaint is storage space within car. My last acura, i had storage in the middle compartment, doors, and behind seats. It doesn't have an overhead storage for glasses either. Besides those minor challenges, the car handles great, i haven't really openned it up, i just reached 1500 miles on it. I am happy with the car, acura makes very good products, look forward to enjoy car for a long time",
  "acura_ilx_2016": " We were searching for a good lease rate and reliable vehicle that was stylish and had good ratings.  This car has a sports car feel, fun to drive, and handles beautifully (except for a small turning radius)!  The stripped down version gets you a sunroof, backup camera, and very nice front seat, all safety features, great Bluetooth,  all for less than many non-luxury compacts, including the Civic, which has higher lease costs and less features for the price.  Well worth our investment!!",
  "acura_ilx_2016": " This is my 3rd Honda and my 2nd Acura. After 300K+ miles and 11 years, I gave my old 2004 TSX to my son who is still driving it. I decided to lease a new 2016 ILX after Acura did the redesign of the exterior and put back the peppy and quick VR4 that was in my TSX. On the plus side, the car is just like the TSX: great handling, terrific on corners and curves, super reliable, solid feel, awesome braking, beautiful long drive on the road touring vehicle, takes 5 passengers around town comfortably with room for luggage, and gets lots of compliments on the styling and interior design. Gas mileage is okay - but not the 29 mpg average promised. Only getting 27 consistently when 1-2 passengers, much less with a full car. On the minus side, I wish the car was like the TSX: the dual screen technology seems redundant and is very distracting compared to the single touch screen the TSX had, the acceleration is hesitant - the car seems to 'think' about moving faster before it actually goes into gears. Gas mileage sucks in city driving. Freeway is 31mpg only, not the 35mpg promised. UPDATE after 1 Year: Exterior pain gets stained easily. Design flaw. Looks like the clear coat is easily damaged by on road flying liquids. OVERALL: Great car, just wish Honda/Acura had not removed the 'fun' and 'simple' aspect of the TSX. Sadly, sometimes I want to take back my old TSX from my son and give him the ILX....",
  "acura_ilx_2016": " Like other Hondas I have owned in the past, this 2016 ILX has been flawless. It doesn't drive like a BMW or Audi, but it handles very well and the ride is good, except on rough pavement. I love all of the tech gadgets and the sound system is good. I live in the city, but most of my work commute is on the highway.  I am a stickler for gas mileage and this car does not disappoint. It routinely gets over 40 mpg on the highway, averages 37 in mixed driving, and has never clocked less than 34 mpg on a tank of gas. I run it with regular gas and have seen no difference in performance compared to premium.",
  "acura_ilx_2016": " Have own the fully loaded Tech plus A-SPEC ILX with the bigger 18",
  "acura_ilx_2016": " Just traded my 2016 RDX Base for the 2016 ILX Premium.  Obviously I am loosing the utility and AWD of a RDX but gaining more features, slightly lower payment, better gas millage, and a car easier to park.  Compared to the 1st gen the 2016 ILX is a huge improvement in every category.  Looks while subjective are much better with a more pronounced front end and a less frump tail end.  The amount of tech and features you get are way up from the 1st gen and the performance of the 2.4 direct injection 8 speed DCT is awesome.  While the performance is much improved the car might be a tad racer boyish for some with it's loud exhaust for those who prefer quiet luxury.  The ILX isn't as luxurious and doesn't perform as well as the Lexus IS 200T, BMW 320i, Mercedes CLA250, Audi A3 but it costs thousands less (up to $10,000 less).  I am leasing my ILX for 24 months but I negotiated my premium edition with a MSRP of $30k to $26,260.  Furthermore the highest trim Tech with A-Spec only adds up to $35k, so is True* luxury really worth thousands of dollars?  For me the ILX has just the right amount of luxury, tech, and value that I can ignore not having AWD, real wood accents, or a German branding.  What I can't ignore is the back seats being a 1 piece fold down and not a 60/40 split and not having a pass through.  Nor am I huge fan of the car requiring premium and the fact that AcuraLink only supports iOS!  Also, while Acura would love to capture a young audience the base and base with AcuraWatch are pointless because the Civic Touring features and price beats those models.  Acura you can't have you cake and eat it too, just sell the Premium and Tech Versions which still are reasonably priced at $30k-35k Msrp.  The Premium with Blind Spot, cross traffic alert, real Milano leather, and the two tier screen system are worth every penny.",
  "acura_ilx_2016": " This is a great combination of luxury and economy.  I paid  $9,000 less than the dealer's best offer on a comparable BMW 320i.  It's pretty quick at 0-60 mph in 6.4 seconds ( .2 seconds faster than the BMW according to zeroto60times.com) but still gets 36 mpg (the same as the BMW epa estimate) on the highway.  After driving the BMW 320i and the X1, the ILX interior materials seemed just slightly inferior.  And the noise and handling were just a little off.  I am very sensitive to squeaks and rattles.  So far, not a single one.  The 8 speed DCT is very smooth and precise.  Driving in sport mode changes everything.  The shift points are at much higher revs and the engine responds much more quickly.  This is my second Acura.  I drove the first one for nearly 200,000 miles and all I did was change the fluids and bulbs...not a single problem. I can't attest to the reliability of the ILX, but I'm betting it will be similarly phenomenal.  The expert reviews are all over the map on this one.  Do you compare it with a Toyota Corolla, or a BMW 2 or 3 series?  Therein lies the problem.  They have to put it in a category to make sense of all the vehicles and this one doesn't fit.  You have to read between the lines.",
  "acura_ilx_2016": " I absolutely adore this car. I have no idea what some people are talking about regarding the seats being uncomfortable. These are the most comfortable seats I've ever driven in. This car is just what I was looking for...a beautiful, reliable and luxurious commuter. The white model really turns heads and by the first week I'd already gotten so many compliments. Interior road noise is perfect, road feel is excellent, steering is excellent, ever little detail in his car screams luxury. Really nothing bad I can say about this car, and no I've not been paid to say these things...this car is just that good.",
  "acura_ilx_2016": " Ok....so after driving my Mini Cooper hardtop and commuting 70 miles a day 6 days a week I decided it was time to trade in the stick shift and grow up. After looking at all the entry level luxury vehicles, I decided on the Acura ILX. My situation is, I wanted economical luxury. I wanted a car I could drive until the wheels fell off. I wanted a car that I didn't have to make difficult appointments for to get serviced or maintained. I didn't want to worry about what service needed to be done when the service due light came on....a burden I had driving the mini. For me, this car works great! I bought the premium package in black right around when they launched the 2016's... Drove it for a year and realized I had made a huge mistake. Black is a horrible color to keep clean when you commute and don't park in a garage! So when I took my car in today for its second ever service, I was somehow made an offer I couldn't refuse on a brand new white premium with ASPEC. There is a major difference between the two. I love the ASPEC seats and odometer and foot pedals. The front looks less like a beak! I'm so glad I upgraded! Maintence is painless and affordable! No stress car for younger commuter! I'm happy!",
  "acura_ilx_2016": " I was looking forward to driving this car because I liked the styling and have owned two Acura TL's. After owning 10 Honda's also , I thought I'd check it outThe car has a nice cockpit but no lumbar support or adjustment so it was out for me with back issues. It is laid out nicely but storage is the least I've seen in any other car. console compartment is small and cheap feeling and the door storage can fit a tennis ball??My main compmaint is a general one with the CVT transmission on ANY car. It COMPLETELY takes the fun out of driving and one feels like they're a passenger in a very expensive lawn mower or sewing machine. These transmissions are solely for fuel effiiciency. Very effective for that but that's where it ends. In one minute I knew this wasn't the car for me. It shifted five times before I got to 26 mph. The 8 speed transmission makes this worse Over al the car has great styling and will last for hundreds of thousands of miles like all Japanese cars. I just want to actually enjoy the driving experience. Acura is only better than Honda of you can spend over $30K. The Civic is a superior car to the ILX and less expensive. Back to Honda or maybe Subaru",
  "acura_ilx_2016": " This is a great car in the sporty entry luxury space. The engine and transmission pairing are strong and energetic. The technology package adds great safety and convenience features.",
  "acura_ilx_2016": " I bought this car because after test driving it reminded me of my '07 Civic Si, which I sold to go back to school, only a bit more refined. However, having spent a couple months in it, any refinement I perceived was a false assumption based on the Acura badge. I'll start with the positives: The engine is good it's a rev-happy Honda engine with an okay noise and feels quick enough. Certainly not under powered, though it can feel like it's working a little hard sometimes at 80mph and above. The transmission is pretty good too, but it's an automatic. This car needs a manual transmission. And finally it has the right balance between ride comfort and feel for the road.Now to the bad: everything else. The worse is the driver's seat. The lumbar support is not adjustable. If you don't like to crank lumbar up to 11, you're not going to be comfortable. The upper part of the seat is even worse. There is absolutely no support for the shoulders, and consequently, zero lateral support. If you make a left hand turn at more than 5 mph you're going to fall into the passenger seat. And somehow my feet even seem to get lifted off the floor when making turns at a reasonable speed, giving an odd weightless feeling that leaves me grasping for something to brace myself on. Which makes driving rather difficult. So you can forget about any spirted driving on twisty mountain roads. Then there's the fact that in the best position I've found, my head is about half an inch from the ceiling, which creates more than a few visibility problems.The rest of the interior just feels cheap, like it was made by Fisher Price. I had been driving a mid-level Ford Fiesta. I assumed that even the cheapest Acura would be a huge upgrade in quality. I was wrong. Here's the things that were betting in the 3 year older and $12,000 cheaper Ford: Steering/handling leather wrap on the steering wheel stereo (the stereo in the ILX is garbage)' phone call quality ease of using phone controlsxe2x80xa6pretty much everything related to the infotainment system. And the overall feel of the interior materials is just not that much, if any, better in the Acura. Also, the trunk is extremely cheap on the ILK. The lid feels like it's made of tin and weighs about 2lbs. So you might think that if you don't care about the infotainment system or having the feel of a luxury car, and just want something with decent driving dynamics, this car is worth a look. If it weren't for the issue with the driver's seat and lack of a proper 6-speed manual, I might even recommend it. But as it is, there are many other cars in this price range to look at, such as the GTI, WRX, and even the Civic Si.",
  "acura_ilx_2016": " I got my car back in April of 2015. Reason I took off one star is squeaky front brakes issue.  It's factory defect and acura is aware of it (Please google on tgat issue if you are interested). Acura did not want to change my brakes at time I came in and I don't have any more time to waste with them so I live with it.  It's a huge disappointed  especially for a brand such as acura. Another star I taken off because I believe few other things could have been better.  Such as,  very rough ride over uneven pavement and especially potholes. No 40/60 rear fold,  whole rear seat just folds.  Steering is a little numb as well. Not too much headroom for tall drivers. Never the less its an enormous value. For $27k you get compact (a plus for some)  0-60 in less than 7 seconds,  great fuel economy,  decent handling,  sunroof,  keyless entery,  duel clutch transmission,  full Led head lights,  Adaptive cruise,  crush prevention system, auto dual climate, heated seats and mirrors,  back up cam,   Acura badge (Might matter to some.",
  "acura_ilx_2016": " No one is paying me to write this review.  Just thought you'd like to know.  I sincerely don't understand Edmund's grade of ",
  "acura_ilx_2016": " I really love this car.  It has everything I wanted for a great price!PRO:($30,000 out the door)This is the perfect car for me since I am not searching for people's envy.  This car has everything in my opinion. It has great gas mileage(I am averaging 32/gallon), galore of standard features like my favorites(resetting the gas odometer and mileage whenever I refuel, also 3 different backup camera viewing angle was very helpful when I need to back into my garage).  The leather are very comfortable.  Stereo with 7 speakers and sub-woofer, usb, bluetooth, HDMI, and sat radio keeps me going on my daily grind.  Great value for my hard earned cash.  I would recommend this car to anybody that appreciate great value and reliability.  CON:If you are looking for true luxury entry-level luxury sedan, this is not it.  As per the review said, the interior are nice but not as luxuries as Mercedes or Audi.  It does not drive with peppiness that you get with Mercedes or Audi.  I find the acceleration weak but the thing is because this car is trying to save gas, so it keep shifting below 2000rpm....(you can do manual shifting if you are into burning up your gas and driving faster).  Your neighbor is not going to b like ",
  "acura_ilx_2016": " I got the Premium pkg. This car handles really well. Great pickup, very stable, breaks nicely, feels solid and safe. I am ver happy with the great mileage. The interior is nice and roomy. My husband and son in law, who are tall fit fine, no complaints. Great looker, I love this car. The Navi I'm not too crazy about, but I just use my iPhone for me, the rest of the great pros override this one feature.",
  "acura_ilx_2016": " If you're in the market for an entry level luxury sedan, you're most likely considering the Audi A3, MB CLA or the BMW 320, along with the ILX. Pricing-wise, the base MSRPs are not that far apart but, once you start adding options, the prices begin to spread apart.  Comparing all the features in an Acura ILX with Technology Plus and A-Spec, the price differences can vary as much as $5k-$10k. Add to that the recent year-end incentives, and the price difference can go as much as $12k.Considering the reliability of Acura, and its traditionally high resale value, the ILX represents the best value in this category.",
  "acura_ilx_2016": " I came from a manual stick shift 2003 Acura RSX Type S. I love that car and the only reason why I stick with Acura. I need a small compact 4 doors vehicle since I'm a family man with two kids. I looked at the Civics, the Accords. But they just blah and not exciting in terms of styling. Plus. I didn't want to be like 80% of the car out there on the road, so many of them. From teeny boppers, grandma's, Grandpa, to your soccer moms. No thanks. So there it is, I got the 2016 Acura ILX with premium/Aspec package. Honestly, its not really an upgrade from my RSX. Everything about this car feel cheap and could be better. Feels like they are rushing it. The gears always shifting. It can never stay in one gear long, it always shift to make sure the gears are highest fuel economy at the current speed. It's good for gas saving but when you trying to merge or switch lane, you need it to be in a gear that responsive to the throttle. Instead, the car will downshift creating that half to second delay acceleration. Coming from a cable, maybe it have to do with the new electric drive by wire, who knows but its really annoying when you need that quick acceleration. Now on the other hand, the Dual Clutch mode is awesome, stellar and works perfectly. I think that pretty much the only part of the car that stands out. Very responsive, smooth gear transition from downshift and up shift. The steering is numb and you don't feel that much road feed back. The handling is good. Not much body roll. The car puts me to sleep. I need some excitement, the thrill of a screaming VTEC kicking in. Instead I got a very boring tone. The seat doesnt have much bolster to snug you in. I feel Acura lost touch with its racing heritage. My other pet peeve is the head room, I'm 5'11",
  "acura_ilx_2016": " This car has met all of my expectations and surpassed most of them, it is everything I was looking for at a very reasonable price point. I previously owned a 2014 Civic EX 4dr, which I bought, at least partially, because Civics are traditionally modders, with a lot of potential for customization. Not so much the case (mechanically) anymore, unless you get the SI, but I work in the city and bumper to bumper commuting with a manual, forget it. At any rate, the ILX offered everything I wanted my Civic to become, sporty, both in appearance and performance (big emphasis on performance), as well as more luxury and Honda/Acura's legendary reliability. I did a LOT of research before pulling the trigger on the purchase and I just don't think that anything out there can touch the ILX if price is at all an issue for you. Go to Audi, BMW, Mercedes, Infiniti, Lexus websites and ",
  "acura_ilx_2016": " I use this car almost exclusively for commuting, about 20 miles each way. It's a good solid car with great value. Acceleration is more than adequate and the extra tech you get with the tech plus package is great. I did have a  problem with my car upon delivery. About a week after I got the car I noticed a vibration, especially in reverse. I brought it in to the dealer and they found that the engine mounts weren't aligned. They fixed it and I was on my way. About a month later the vibrations came back. I brought it back to the dealer and they replaced the engine mounts (covered under warranty). I haven't had a problem since.Pros:Great value for what you spend. Braking is excellent, gives a real secure feeling. I know a lot of pundits complain about the dual screen system but once you get used to it there's no issue.Cons:Transmission at highway speed is very smooth. At low speeds, particularly stop and go traffic, the transmission can be very choppy and downright uncomfortable. After about a month of driving I became more attuned to this and am able to avoid a lot of the choppiness. It can still be a minor annoyance. My other complaint would be a lack of lumbar support. Any car that claims to be luxury must have it.",
  "acura_ilx_2016": " This is my first Acura and generally I am very happy.  I haven't had it in for the first service yet but wanted to know if anyone is having issues with the infotainment system.  About once a week when I start the car the radio stations will come up with all the programmed numbers wrong.  The stations are correct if you select them but the numbers displayed are wrong.  Sometimes it will correct itself after a while and sometimes it won't.  Twice the backup camera has not gone off when I shift out of reverse and the upper display stays on the back up camera the entire time I am driving.  Next time I start it will go back to normal.",
  "acura_ilx_2016": " I ended up trading in my 2016 Acura ILX after owning it for only 3 months.  There was a brake defect where the brakes kept squeaking and after the rotors were replaced once and pads twice, the issue came back.  I think a recall will come at some point, but I was not going to wait because I was very disappointed.  The other Acura's I have owned have been great, I was very surprised that this car was released with this issue.  I traded it for a Mazda CX-3 and it is more fun to drive and and feels more powerful then the Acura.   The other issue with the Acura I noticed was the engine hum, it actually bothered my ears when I had the windows open.  The 2014 Acura ILX I had I liked better overall after owning this one for 3 months.  Before purchasing ask the dealership to give you one of their loaner cars that has a few miles on it and make sure you like driving it in everyday driving.  I would recommend buying a used 2013-2015 ILX instead.  Or a Mazda 3, I think the Mazda 3 GT would be more fun to drive everyday than the Acura.",
  "acura_ilx_2016": " Got a great deal to trade my 2013 ILX for a 2016 ILX Premium pkg Granite Luster/Graystone interior.rI never had any problems with my 2013 and really like the updates on the new one. Performance is up due to the new engine but the old one was efficient and peppy. Good ride quality and very good value in the entry level luxury class. Compare to A3, CLA feature for feature and you'll see what I mean.",
  "acura_ilx_2016": "New jewel-eye LED headlights look great and add an uplevel look.  LED tailights as well.rnLike the addition of the memory driver's seat and the dual tech screens.  Acura Premium sound is great. Addition of the Blind Spot and Cross-traffic alerts is very helpful.",
  "acura_ilx_2016": "I'd like to see Fog Lights standard as they came on my 2013.  Otherwise, excellent car!",
  "acura_ilx_2016": " Got the ILX like 3 weeks ago, so far no problems, fast, corners nicely, good on gas, I like better than the A3, felt cramped inside, handles as well as IS250, anyone feels differently about you are subject to your own opinion, I am not a critic just a regular guy typing my own views...",
  "acura_ilx_2016": "pretty much love putting the car in cruise control, let it drive its self for about 15 sec. before you have to put your hands on the steering wheel...",
  "acura_ilx_2016": "they need to put LED turn signals on the Mirrors, also the seats need Lumbar support, and for the final suggestion Heads Up Display...",
  "acura_ilx_2017": " I have owned two previous Acura's and loved them.  This vehicle is poorly made.  I had 13 things wrong with it, and the dealership and Acura customer service were unwilling to assist me.  What a way to treat a loyal customer!  Do not waste your time or money!!!",
  "acura_ilx_2017": " Feels like Honda literally sent Acura a civic LX and they ",
  "acura_ilx_2017": " Overall extremely pleased with my new ILX. The vehicle is attractive to the eye with quality panel fit and finish and a stunning paint job. The dual clutch transmission is a large step above traditional automatics and has quick throttle response and incredibly nimble shifts. Overall engine power leaves a little to be desired, but at 201 HP it is quick off the line and peppy enough to put a smile in your everyday commute. The car handles fine and sticks to the road as expected for the size and weight. Steering feel is light enough to make for easy everyday commutes  by sporty enough to provide decent road feedback when winding about on country roads. Interior quality is OK, a bit below my expectations for a luxury vehicle but maybe right on par for an entry level luxury car. The ODMD head unit could use a refresher but is generally easy enough to navigate through after spending some time with the user manual out exploring all the system capabilities. Audio quality with the Premium system meets my expectations, with decent power and bass response. Imaging and dynamic range are better on this stock system then any other vehicle I've owned. Best thing is it's a Honda so the reliability, resale value, and quality are something I do not have to worry about. Perfect car for a young professional looking to purchase an affordable, attractive, and fun to drive luxury vehicle.",
  "acura_ilx_2017": " I just leased a new 2017 Acura ILX two months ago. This was the seventh Acura I've owned or leased, beginning with the 5 cylinder Vigor many years ago. I loved each and every one of these cars...except this one. I HATE it. There should be a warning sign on these- ",
  "acura_mdx_2016": " Great SUV, lots of safety , comfort features and rides nices.   Don't like the 9 speed transmission it shifts hard , unexpected in lower speeds.    My wife loves it, and that's all that matters.",
  "acura_mdx_2016": " Purchased a brand new 2016 MDX and within 10 months started having problem with the transmission - jerking with sharp squeaking sound whenever gears shifted (lower gear). Had driven only around 9500 miles when this problem started. Dealership replaced the transmission, but then also changed the radiator and the starter (since those also apparently had issues !) - all this took almost a month. In short, major components were bad/poor quality (?) in a brand new car - only major remaining part to replace is the engine !!! After the repairs, car still gives slight jerk during gear shifts. Dealership and Corporate customer service response was - slight jerk is normal for MDX. So buyers beware - from personal experience it seems Honda quality is not transferred to its luxury brand !!! Consider alternatives , do your research before spending your dollars....",
  "acura_mdx_2016": " After owning 5 Accords, 2 Odysseys, 1 CRV and a Pilot without any issues, I figured the next logical step was Acura. We test drove and almost bought a Ford Explorer Sport, but the Honda loyalist inside of me said the Acura would be a better overall purchase. From the moment we leased this MDX 6 months ago it has been a HUGE let down. The transmission is horrible and shifts almost violently (dealer said this is normal), the suspension pops and clunks on every bump (3 attempts by dealer to fix), the touch screen is cool in theory, but when you just want to turn on the seat heater or adjust the fan it takes far too much effort.  The cargo area is poorly designed (in my opinion) because the roof slopes in the rear and limits capacity. The seats seem to be okay they are a little small for my 6'3",
  "acura_mdx_2016": " I've driven the Acura MDX model since it arrived in 2001 and been an Acura owner since 1995. This being my 4th MDX the 2016 is the best driving experience I've ever had. I was a little nervous with the move to a crossover design, happy with the feel of the RL I've missed. The slight one inch lowering to the ground was a concern but still keeps me high enough on the road to see ahead in traffic. The new safety innovations are incredible and give me a new sense of road safety beyond what I've ever experienced. The gas mileage is through the roof beyond what I expected which was my main motivation for buying in May of 2016. I don't get all the transmission complaints, but I must say, I don't drive the car fast, I drive it economically for safety and good gas mileage. For this reason, the car is a dream. If you want a sports car, then go buy one. I love having the option of the engine stopping if you press the brake a tad harder at a stop. At first this was strange, but now a natural part of driving the car. All the technology took a small learning curve but once you learn, it's part of you. My Acura dealership has been completely responsive with any questions I have. The MDX handles beautifully with new smart technology helping to keep me in my lane when driving the freeway. I love the distance setting of three choices when using cruise. I'm not trying to out drive anyone, just selecting my space on the freeway to drive most economically. Hitting 28 miles to the gallon on a long trip is the best MPG I've ever received from any Acura. The sound system and tech package is delivers all I need and then some. This new 2016 MDX delivers the most enjoyable driving experience I've ever had!",
  "acura_mdx_2016": " This car has all of the creature comforts.   Good handling, comfortable interior, quiet on the inside, great gas mileage for an SUV.   None of those things matter, because these vehicles have BAD TRANSMISSIONS!    Have you ever been in a car with someone who is learning to drive a stick shift?   That's the way this car shifts in low gears.  It bucks, snorts, hesitates, and can't decide what gear to be in.  If you are coasting down a hill, it surges and accelerates.  Driving in bumper to bumper rush hour traffic was like wrestling a bear.  More than once I thought I had been rear-ended in slow moving traffic.....nope, just the car shifting.   I had the car back to the dealership 4 times.  They couldn't get their stories straight.   The Salesman told me it could not possibly be doing what I described and dismissed me.  The Service Manager said ",
  "acura_mdx_2016": " Overall, the car rides comfortably and reliably, handles well in all weather conditions. My only two complaints: the transmission is a bit sluggish (took it in and they did an update, but don't really notice a difference) and the GPS is absolutely horrible. I am very disappointed that, after spending $50k on a brand new car - a car where, btw, the GPS is not standard (included in the technology package, which I have) - the GPS is utterly substandard. Not only is it slow, it takes 5 minutes to enter in an address, and half the time it is just plain WRONG. Very frustrating. I have to use my Garmin because it is so worthless. Acura owes better to its customers.",
  "acura_mdx_2016": " The base model has no spare tire and no tools to change one.  I was stuck with a flat tire and had to go through an ordeal to get the flat fixed.",
  "acura_mdx_2016": " I purchased a 2016 Acura MDX from Jay Wolfe Honda in Kansas City, MO and so far my total overall experience is a ",
  "acura_mdx_2016": " I have had my SUV in for repairs several times. Window would go up and down. In the fourth try they almost fixed it. It doesn't just go down on its own any longer. It just doesn't stay up if you roll it down. It takes about 4-5 tries. The USB ports don't work. They said it's my phone, I have had 6 chargers and a new phone since my purchase. The computer/transmission has been in 3 times. They claimed it was a computer issue with shifting. However when my car failed to go over 30 MPH. I called, their response was there is no engine light on, there is no problem. However after my car being there for a week, they called to let me know the transmission is faulty and needs to be replaced. I called my sales rep (who we've used for 5 cars) to see if he could swap my car out for a similar one. He didn't help and told me to call Acura and file a complaint. He also said they will not do anything to help you. Extremely disappointed after spending 50k on a lemon. I did plan on purchasing this car at the end of the lease.",
  "acura_mdx_2016": " I have bought a brand new Acura MDX in February, 2016. My experience with my new Acura MDX is pretty bad so far.On June 20th, I had the first experience of the problem with dashboard showing that there is Transmission, Emission, and all other system problem. The car stopped on the road. Later it started but continue to flash the warnings.This same problem occurred second time on September 6th and at the time, I was starting the car and it won't even start. Later it started but continue to flash the warnings. I took the car to Acura dealership on these both occasions and it shows up later.Again, Third time it happened on October 30th. Checkout the https://community.cartalk.com/t/dashboard-showing-that-there-is-transmission-emission-and-all-other-system-problem/96331 for multiple people reporting the issue. Please think hard before you sink in 50K for this car.",
  "acura_mdx_2016": " Rough shifting from idle into first and second. Jerky shifting at low speed if you do not accelerate uniformly.  Not worth the $50K+ price.",
  "acura_mdx_2016": " Owners should know, and DEMAND, that early 2016 models built in 2015 have a software update to the transmission, technical service builletin 15-054, which changes the shifting dynamic of the car, and SHOULD resolve most of the transmission jerkiness issues.  Unfortunately, my dealership didn't apply the update, BUT next time my car is in for service, I will DEMAND they fix it, because I too, experience rough shifting, surges while braking and going downhill, and poor overall transmission performance.  THERE SHOULD BE A RECALL TO UPDATE THE SOFTWARE ON THE TRANSMISSION.  ACURA, ARE YOU LISTENING TO YOUR CUSTOMERS?  Acura should be embarrassed to turn away customers.  No wonder they are LAST in customer satisfaction.  Now...onto the car.  Two major issues with this car: the transmission, and the infotainment system. The interior is nice size and comfortable, even though it doesn't feel so luxurious.  Handling is great, ride is smooth when the transmission isn't jerking you all over the place.  The overall infotainment system, navigation included, is SO slow and my 2008 Infiniti G35 had a better nav system.  It's pretty pathetic.  This is my first (and probably last) Acura until they get their act together, stop trying to fool customers into thinking their product is the ",
  "acura_mdx_2016": " Acura customer care refused to return my calls for 8 months when the backup camera was intermittently not functioning. Even after I send videos of it occurring they refused to accept responsibility or communicate. Acura clearly doesn't care about customers after they make the purchase. The navigation system and voice recognition system is really a joke as well. I replaced it with a dash-mounted iPhone. The car does handle well and the all-wheel drive is great.",
  "acura_mdx_2016": " Overall not a bad car for a US manufactured vehicle, lots of gadgets that are fairly standard with other luxuries.  My first time owning an MDX, the jewel lights are great.  I am a little annoyed by the dull hum when you turn the steering wheel.  The service guy says that is how it is made.  I did not hear it in the other vehicles.  The controls screen HAVE to be UPDATED to include a single button to change air circulation, when you see some exhaust and dusts you have to scramble to find the control and press TWO BUTTONS to change to recycle.  I am able to get by just putting the car in AUTO for AC.  You have to press TWO BUTTONS to turn on and off AC!",
  "acura_mdx_2016": " I've only owned it for three weeks. The nine speed transmission has issues when shifting into second and third. Rough shifting from idle into first and second. Engine revs up then will often jump from first to third. Very pronounced action.",
  "acura_mdx_2016": " Do NOT buy this car.  We replaced our 2013 MDX with the 2016 and wish we had the old one back.  This car is a dud.  Do not buy it.  We were driving on the expressway going 65 mph and the transmission catastrophically failed.  So glad we had just went through a 1 lane stretch on 75 undergoing construction and were able to pull over to the side of the road.  Dealership was awesome, but this car is terrible.",
  "acura_mdx_2016": " The navigation map system in not reliable.  When an update becomes available, be prepared to pay $145 or more plus tax , shipping for the software.  My concern is traveling outside of my hometown to places that have updated their roads.  Unfortunately for the amount of money spend for this vehicle, you CANNOT rely on the navigation map system.  I purchased my vehicle in June 2015 and today (9/13/16) I contacted Honda Navigation System and was told there is no information about a forth coming update to the navigation map system.  I have to use Google Maps from my mobile phone which is much more reliable.",
  "acura_mdx_2016": " I decided to lease a 2016 MDX. It currently has about 700 miles and Oh man!!! what a dissapointment. The car jerks going from gear 1 to gear 2 and also to gear 3. It is something that you are not supposed to feel on a $50k vehicle.....I have also checked with few of my buddies that own mdx. They have the same feeling about the gear shifting......What a bummer!!!",
  "acura_mdx_2016": " I bought a 2016 MDX at Apr 2015. The car has unusual new car smell. At the beginning, I thought it will disappear soon .I am wrong. I can't stay in the car without the window open for more than one year. But unfortunately after two summers, the smell of new car just reduced a little bit and the leather seat still gives off strong chemical odor. I can confirm because if I smell closely to the leather it's just too strong chemical odor. I have owned multiple cars with leather seats before. This is the first time I hit the issue. I very understand that leather products usually has ",
  "acura_mdx_2016": " I thought many times before writing this review. I felt that there was no need to let others know about my problems , but my conscience just kept telling me to share my thoughts with the media. When I was driving home the first time from the showroom there was a metal knocking noise under vehicle and was quite concerned. I immediately called my salesman who put me through to service.the manager said there is a bulletin on this but acura had no fix ,but are working on one. i asked how long? and he responded by saying they have been working on it since 2014.I laughed and then choked and said what are you talking about. He said the design of the parking brake cable was not designed correctly and it knocks like a chain hitting the bottom. after quite a few adjustments and the rear brakes overheated from  overtightening the cable, I just gave up and  said I will live with it until acura comes up with a fix. Well, to continue, Ive had countless parking sensor issues that just go off even if no one is around waiting for the red light to change. It sometimes scares me thinking another vehicle is approaching .The only way to shut the sensors off is to override them and shut the system off completely. they removed my bumper 6 times ( damaging the bumper)and replaced modules and sensors and harness and still no fix.The dealers remedy is to just shut them off permanently, even though i bought the advance model to get this option factory installed.My preset steering wheel only works sometimes. My 9 speed tranny clanks ,I guess it wants to let me know its still there . My brakes practically go down to the floor and acura tells me that its ok. Seat adjustments are not great,but i guess acceptable. My rear backup camera looks like I have been driving in a dense fog ( useless) .They say other mdx cameras look similar. The ride quality on smooth roads is fine ,but try hitting a few minor potholes and it goes right through the cabin. While I was even servicing the vehicle a woman was complaining about the terrible ride quality and vowed to sell her mdx just to keep her sanity. There is a scraping noise when you first start the suv in the morning. Might I have to say more. Acura customer relations keeps telling me that they would like to continue working with me to correct these issues after more then 5 attempts ( i stopped counting) and yes I am aware of the lemon law.I said the right thing is to put me in another vehicle and you can continue to correcting these issues on your own and spend 24 hours a day to figure it out so other loyal customers don't suffer. Acura ,unfortunately with being the best selling luxury suv cannot get it right. i guess people gravitate to it because the price is great compared to other similar suvs .Also, acura shares the same mother company as the civic and accord who have held top honors for many year, so people that want luxury and reliability will hopefully get it like the honda products previously mentioned.I am not writing to punish acura  I just want them to get it right. In closing, Maybe I just might just decide to stop punishing myself one day and move on to another brand after owning acura's for many years. I guess Im finally getting wise that taking off a shield on the front grill or giving real wood trim instead of plastic will ultimately not shield this company from customers realizing that there is something wrong here. What acura needs to do instead of fixing a grill issue is to fix mechanical issues that are the real reason why people have always purchased honda products in the first place called reliability.",
  "acura_mdx_2016": " 2016 Model, only 8200 miles has transmission problem. Dealer told me transmission to needs to be replaced. For a brand new vehicle we had small minor issues from the beginning. This one is big. Dealer has been very courteous.",
  "acura_mdx_2016": " The folks at dealership are great in service and sales but they cannot solve the issues which are congenital to Acura important one being Jerky transmission , the movement is jerky at low speeds, during accelration and marked in low gear (S). The climate control fans make loud noise . A software update made it worse.  Even the seat memory fails !! Bluetooth cannot recognize my wife's Iphoe 6+!!!. Audio is good.",
  "acura_mdx_2016": " We got a new 2016 MDX and before it hitting 3 months, our new MDX almost got my whole family hurt (or could have been worst). While driving on the freeway it just suddenly stop while I was changing lane. Luckily the car behind us managed to stop and avoid hitting us. I tried to restart the engine and when it did, it move very slow and roughly to the shoulder of the freeway. After restarting the engine, ALL THE WARNING LIGHTS  came ON including Break System Failure or Malfunction. It scared my whole family and it was the most horrible UNSAFE DRIVE HOME for hours worrying if we still have break system working. Dropped of the MDX at our local dealership and until now (about 9 days now) still trying to figure  things out.. We feel like this vehicle is just so UNSAFE now and it basically traumatized my whole family being in this MDX.  Will review lemon law and make sure we don't become the CRASH TEST DUMMIES for this. And I hate hearing them say ",
  "acura_mdx_2016": " I traded my 2013 Acura MDM in for a 2016 and am very disappointed in the new car's transmission.  It is very clunky and shifts in and out of gears unnecessarily.  Based on the transmission alone, I would not recommend this vehicle.  The old transmission was a 6 speed and was much smoother than the current 9 speed.  At highway speeds it is fine, but in ordinary city stop/go traffic it is not.  I do like the lane change warnings and the warnings that you get when you are backing up that another car is approaching from the sides.  This is very helpful when pulling out of a parking space when another truck or SUV is next to you.  The car informs you someone is coming before you can actually see the oncoming car.  Very nice feature!  I wish Acura would offer a HUD, I have one on a BMW and it is another feature that once you have, you don't ever want to give up.  The navigation system display is not very well done and the software it uses is not very efficient, also much better on my BMW.  All-in-all, I would rather have my old MDX back.",
  "acura_mdx_2016": " Great ride, love the lane assist. Took it on a very long trip and it performed great. Surprisingly great mileage.Back seats do not recline which is a bummer for our kids. Navigation system is a bit clunky with the two screens.",
  "acura_mdx_2016": " I looked for a new car for months and decided on this nice MDX, only to be left on the side of the road when the transmission broke.  We waited 3 hours for a tow truck to come.  My 2016 MDX had just 3800 miles on it.  I asked for a new transmission, but they said all it needed was a gasket.   I ghad a BMW which I loved, but it had 190,000 miles on it and I wanted dependable transportation for traveling now this is what I am stuck with.  I will say the people at the Acura dealer were very nice, but I did not get great end results.  When you spend that kind of money and this happens they should make it right.",
  "acura_mdx_2016": " I've owned 3 MDXs--2005, 2010, 2014 and I've loved them all. Each of those years I test drove  a variety of SUVs  (the usual suspects) and always ended up with the Acura!  So when the 2017 Acura hit the showroom last week, I was pretty sure I would end up buying another one.  It's not going to happen.  Took it for a test ride and noticed immediately how differently it shifted when accelerating onto a highway.   Couldn't get out of its own way--that's the way it feels anyway.  Back in the showroom the salesperson told me they changed the gears from 6 to 9 back in 2016.  I have no idea what that means I only know that the car doesn't feel right going through NINE gears.  Like I'm towing a boat or something.  It has the power it just takes too long to get to it.  What a shame--just when they finally changed the front grill.",
  "acura_mdx_2016": " After owning Hondas for over 30 years and a 2004 Honda Pilot for the past 13 I decided I was going to get myself a luxury SUV. Given my happiness with Honda vehicles, I always assumed it would be an Acura MDX. After taking it for a test drive I have nothing really bad to say about the vehicle, only that it looked and drove like a very, very nice Honda, but not what anyone would consider a luxury vehicle. It lacked the plusher interior as well as the driving enjoyment that one would expect from a luxury car (at what what still a luxury price). As a matter of fact, I also test drove a completely decked out 2016 Honda Pilot Elite and found that other than being even bigger tan the Acura offered similar features at a lower price.",
  "acura_mdx_2016": " I researched the the 2016 MDX for 9 months before buying. I'm so glad I did. I've owned two MDX's since purchasing my first MDX in year one of the MDX introduction in 2001. I'm amazed at the transformation, I'd been driving my MDX with 180K miles. Having also been an RL owner, I now feel I have the best of both vehicles in one. The slightly lowered height from the road is just perfect! The few lower reviews of the entertainment system has not been a problem for me. There's a lot to digest with so many great features, I take each feature one at a time which for me has been an enjoyable easy process. I love the new touch gear shifting! I love the sportier drive for an SUV, it really does not feel like I'm driving an SUV. The gas mileage increase is sweet, which is one reason I waited so long to buy a 2016. Love the seat air ventilation system that keeps me from back sweating during hot summer months. I can now seamlessly play music from my iPhone. The biggest surprise and enjoy is the warning system and lane keeping assist system. I feel like I'm now protected from blind spots when changing lanes and drifting out of my lane. This is simply the best vehicle I have ever owned! A huge leap of comfort, safety and technology in the past 10 years! I've never experienced this big of an upgrade in any vehicle I have ever purchased. Love this vehicle!!!",
  "acura_mdx_2016": " My car was making a loud squeak sound while shifting gears.  I was told that there is a leak of coolant into the transmission.  They need to replace the transmission already.  What a piece of junk.  Can't believe that I bought this car.  Going to go after the Lemon Law for assistance.",
  "acura_mdx_2016": " The 9 speed transmission is terrible. Worst I have ever had. I will check out the Lemon Law in our state.",
  "acura_mdx_2016": " The BadSlow electronics especially navigationiPhone interface doesn't work well Auto idle awfully annoying and can't turn off permanently Doors don't shut well and often require 2nd attemptFunky noise at 18k when shifting gearsPaint seems to chip more easily than other vehicles Auto wipers no so goodClimate controls not convenient GoodPeppy and quiet smooth ride. AWD is spectacular in snow",
  "acura_mdx_2016": " I began leasing this 2016 in December of 2015.  After 5 months and about 6,000 miles I noticed a ",
  "acura_mdx_2016": " The tech package was better in our 2004 MDX, Impossible for a six foot man to get in and out of drivers seat, and lastly the car has dash rattles and not only that the rear of the suv  it sounds like it is bottoming out when it crosses tar stips.",
  "acura_mdx_2016": " The MDX overall comfort with all the gadets is top notch. If I had to write any negatives about the vehicle would be the lack of fog lights for a near $60K luxury SUV. The other, is merely personal with regards to settling for the MDX as it wasn't our first choice because ",
  "acura_mdx_2016": " I have had the car for 7,000 miles now. The transmission is very jerky. There are times when making a right turn going from high to low speed and trying to get the car back up to speed is a pain. I have to push the accelerator much harder around turns and the car struggles to find a gear. For a luxury car, this is not acceptable. The drive is not fun at all and the service department at Weir Canyon Acura said this is the way the car drives. I have called Acura directly to log a complaint. Contact them directly so they can fix this issue. I don't think I would buy another Acura again.",
  "acura_mdx_2016": " My wife did not like the tricolor interior - the dash drab gray, the seats are whatever the trim color is supposed to be and then there are simulated wood appointments in the middle.  I could have lived with it but it sure was not attractive.  We're going to wait to see what 2017 or 2018 brings for Acura and Lexus.",
  "acura_mdx_2016": " Background: Purchased this 2016 model in May of 2015 - have driven for a year.  Thud/clunk noise e-v-e-r-y time I accelerate from around 40 to a higher speed.  Head mechanic at dealer acknowledged this shouldn't be happening, had my car for weeks, put in a new drive train.  Problem still there so then they told me that all of the MDXs do this.  Wait-what??  Engine will shut off when I stop, every single time I stop, unless I deactivate the fuel saving feature.  Get in the car in the AM, deactivate, go to grocery, get back in car, deactivate, stop to get gas, get back in car, deactivate.  You can see how irritating this becomes on a daily basis.  Dealer tells me no way to get around this.  Driver's side window rattles when it's about 1/3 of the way down.  After my first month of driving this car, transmission made a thud noise when in reverse (dealer was able to fix this).  Very jerky ride at slow speeds (i.e., pulling slowly out of my driveway or rounding a corner).  Lots of ",
  "acura_mdx_2016": " These is the list of problems that I had after two weeks (630 miles) The Car is in service center.1. Navigation problem with failed HDD - take about week to fix2. Transmission,  The ride is jerky at low speed - service told me that never reported as problem  and not fix for it. 3. Back up camera feed is showing for long time after driving forward - They will try to fix it.* Dealer told me nothing wrong with transmission and try different settings might fix the problem which means no solution and no fix.*  I had 4 Honda/Acura  before Prelude, Pilot, CL, RL and this time I am so disappointed.  Maybe no more Honda/Acura in the future.This is follow up on the fix.* Dealer service department call me after 1.5 weeks after I drop off the car about a problem with audio system.   Now waiting for new audio system to arrive.   Mean time the loaner car is making squeaking sounds and this car has only 3800 miles.  I hope other people have better luck with this car.",
  "acura_mdx_2016": " Chose the MDX for a few reasons - reliability, versatility, build quality, value.  Been very surprised that car does not deliver well on at least two of those traits.  Had a transmission issue the first day I drive the car.  Transmission got stuck in low gear.  Was solved with a software upgrade and been ok so far.  I did a lot of research on the transmission issues and was under the impression that the ills of 2015 were fixed in 2016.  Not sure of that.  Next issue was a rattle from the rear of the car since day 1.  Turns out that a bolt was dropped into the chassis during assembly which required taking out part of the interior to find.  How did that ever pass the quality check before delivery I don't know.  On a positive note, I am actually getting great mileage - averaging 25 mpg on the freeways, far better than my last Lexus.  But the car feels cheap and as if corners were cut.  Lots of plastic and poor damping on the different cubbies in the car.  My Lexus was far superior for only about $3k more.  Still 2 1/2 years on my lease but this is my last Acura.  I grew up on Hondas and Acuras but feel Acura, at least, has lost its way.  Back to Lexus for me.",
  "acura_mdx_2016": " Loved the RDX and followed with the MDX. Mistake. From cold start the car takes a few seconds to download (or open) its software and the initial start is ",
  "acura_mdx_2016": " Mostly this car is OK for the price.  But the transmission is terrible and has an odd shift that makes it uncomfortable to drive and for passengers.  No matter what ",
  "acura_mdx_2016": " Even though I still love the overall design of the car, I don't like that certain features does not come standard. The navigation system should be standard in all MDX because I have seen SUV of lesser value  come equipped with a navigation system. Also the Accurawatch  package should have been standard on the 2016 MDX, is now standard in the 2017. Overall a stylish ride that is easy on the eyes.",
  "acura_mdx_2016": " The transmission on this car is just crap.  I bought it brand new and didn't notice shifting problems on the test drive. I obviously should have test driven the same vehicle multiple times before purchasing it because after about three days I noticed the occasional awkward shifting.  I just told myself it's a brand new car and needs to adjust on its own. I feel like it did get better after a few months - or I just got used to the awkwardness. Sport mode was not even an option as it was super jerky and completely annoying.  At 6,800 miles it suddenly started making a high-pitched chirping noise when shifting into second gear, almost like the sound of tires screeching when peeling out. I immediately drove it to the dealership and the technician confirmed the issue. The next day they called and said the transmission needed to be replaced.  What!? I've owned several Hondas over the years and never had major issues. I thought I could trust Acura for their reliability record, but apparently not. The 2016 Touring/Elite models of the Pilot have the same crappy transmission and complaints are well documented. I hope Honda/Acura will take some responsibility for the defect and offer a recall. If not, I will be pursuing a lemon law buy back.",
  "acura_mdx_2016": " After driving this vehicle for 12k mile, I think this vehicle is a good compromise. It's not as sporty as a BMW X5, not as big/bold as a Chevy Tahoe, not as pretty/sexy as an Audi Q5, but its (fully loaded) price is most likely the lowest in this group, its fuel efficiency is good (I averaged almost 21 mpg with mostly city driving, and about 28 mpg on highway), has very large cargo area (if you fold down the 3rd row), a quiet/comfortable ride, handles impresively on snow, and it comes with almost all the safety features that you can imagine.A few major gripes:1) Watch out for the middle seat's seatbelt (a real safety hazard, and a major design flaw) - since the seatbelt automatically retracts to the roof where it is anchored, my mom was hit hard on her face (by the seat belt buckle) as the middle passenger released his seatbelt.2) On a two-lane windy road, the auto collision sensor can mistaken an oncoming vehicle (in the other lane) as an obsticle and suddenly hit the brake for you (which can be very scarely to anyone in the vehicle)3) Unimpressive accleration for a 3.5L VTECH engine.4) So-so brake performance5) Lacks a ",
  "acura_mdx_2016": " Great vehicle for the price.  We compared it to the lexus rx 350 and the mdx was the best bang for your buck!  More space with the same technology and quality as lexus and cheaper price.",
  "acura_mdx_2016": " It drives comfortably and smoothly.",
  "acura_mdx_2016": " 2016 Acura MDX SH-AWD with Technology and Entertainment package has been very good so far: My overall experience with Autonation, Stevens Creek has also been very good, very friendly staff.The salesman Mr Allen Kim was very helpful so does the finance person Mr Christian.If you happen to decide to buy Acura buy it from Autonation, Stevens Creek and ask for Allen Kim.The car itself is very spacious, nice / plush interiors and I like the push-button gear shift once I got used to this.+Good Performance+Overall comfort+Excellent safety+120V AC supply in the rear console is very good and handy on the go.Cons:-Cruise control is not as smooth and speed is not constant when the roads have elevation.-Navigation is slow/un-intuitive.-Glove box illumination works only when the engine is ON-Third row leg space is okay for kids and bit jammed for adults but for the price/size, I guess this is okay.I was also considering Audi Q7 but I think I made a good decision to stick with Acura MDX due to its looks and features.Few things Acura could improve further, given that this is the ",
  "acura_mdx_2016": " Still loving my MDX. Just had my first service at the dealer. Ride was great before they balanced and rotated my tires. Now it rides like I'm driving on a pothole filled dirt road. I will be taking it back. Really? They can't even get this right.",
  "acura_mdx_2016": " Always head right to the Acura dealer when we need a car! Have an older Acura MDX that I love!!! The new Acura looks nice, handles well but seems a bit smaller inside (although I was told it is a few inches bigger) the head room in the third row is cut back because of the angle of the body. This limits who is able to sit back there. It is very jerky in the shifting while excelerating and if you are moving very slow it feel like you are not in gear...Not happy with that! In addition, the radio is horrible. Most stations that I listen to do not come in clear. I have no problem with this in my other Acura or even the car I had before this one. Clearly the antenna is not good! I just feel like from my old Acura (2005) to this one (2016) they have definiately cut corners and the quality is not as good! For the price you pay I would expect an all 5 star rating which I can not give. We have been loyal Acura cutomers but think that this may be it for me. I am able to get more perks from other vehicles for the same or lesser price. I will be shopping around for my next vehicle!",
  "acura_mdx_2016": " I got 2016 MDX in last June. It was ok for about six month then from passenger side middle row some kind of noise (like two plastic or rubbing two seat together) start coming. I try real hard to pin point but can not pin point. Now is about more then eight month I have vehicle and sound is coming everywhere, I don't know what is solution, is that my vehicle only or most mdx? Very very poor acceleration and uneasy shifting. I plan to change with other brand SUV, but before that I am going to take to dealership and/or body shop just for that  noise.",
  "acura_mdx_2016": " Driving is fun again. Once you go Acura, you won't go Back-ura!",
  "acura_mdx_2016": " Smaller and nimbler than a minivan but with third row has more flexibility than most crossovers.  And some nice luxury and safety extras. A little sluggish in first gear but other than that a great car.",
  "acura_mdx_2016": " We love the vehicle, getting use to all features. Salesman was very professional, courteous and  made feel like coming back for next vehicle.  Lots of things too early to rate since we have driven only 300+ miles, time will tell.   Overall  we are happy.  Too early to fuel economy rating.Draw back is no spare tire with the pricey and luxurious vehicle.  Road free road side assistance in case of flat tire how long it will take in town and when I am on roads 100 or more miles away from nearest facility ?   It would not have cost Honda more than $ 50 dollar more  per car which consumer pays. In my judgment it is poor decision on Honda's part.",
  "acura_mdx_2016": " This is the worst purchase ever.  The seats are very uncomfortable.  Cheap build quality as the doors rattles when you drive.  Terrible drivetrain.  Lots of noise and vibrations.  If you want a real luxury car, look at Lexus, Mercedes, or Bmw.",
  "acura_mdx_2016": " absolutely love this vehicle.",
  "acura_mdx_2016": " We just picked this up last week without even having the intention of buying an Acura.  We originally looked hard into the Toyota Highlander and Honda Pilots but realized the lease incentives were absolutely horrible due to the demand of both of those (we are in a spot in our lives where leasing makes more sense).  We started to look into non-3rd row options since our youngest is 2 and we have another one on the way in June, and we could go for a 3rd row when they got older. So I noticed a lease deal on an Acura RDX and wanted to investigate since we didn't like the RAV4 and CR-V options.  The RDX drove well but was too small.  The salesperson told me about a lease deal on a base MDX so we test drove it and LOVED IT.  The features are the same and the quality is better than the higher trim Highlander and Pilots and the lease payment was cheaper per month.  It has heated seats, leather, moonroof, backup camera, dual cabin screens, a 3rd row, jewel eye LED headlights, among other options.My wife has been driving is most of the time but so far we love it.  Definitely give it a shot if you're open to lease and are considering Toyota/Honda 3rd rows - you'd be surprised on payments.",
  "acura_mdx_2016": " This is our first Acura. Although it has only been a month, this car has been a pleasure to drive. No vibrations or problems with shifting as mentioned in other reviews.  The ride is smooth and comfortable, more so than with the Lexus RX350 that we tested prior to purchasing the MDX.",
  "acura_mdx_2016": " You should not buy this car! It makes terrible noises that come from the rear end, possibly the suspension.  My car has been the the service department in Omaha, NE 3 times and the first two times they quickly replaced parts and said they fixed the noise. The 3rd time, I rode with a service tech and service manager and they heard the noises but said they did not know how to fix it.  When I returned to pick up my car the service invoice coveniently mentioned that they ",
  "acura_mdx_2016": " Three days after we purchased the Acura MDX, we drove it 500 miles to Lake Tahoe through blizzards!  The AWD works better than my 4/4 Toyota Sequoia!  We passed cars, trucks with chains.  .stuck! We drove right though.  At one point in time we were up to our door panels in snow!   On the way up we got 24 mpg and on the way home to San Diego, 28 mpg, thanks to a nine speed transmission and half the cylinders shutting down on cruise control!  It is unbelievable how well this works with 290 hp to boot.  Consumer reports rated this vehicle an 89 rating, tops in the luxury mid size SUV category. To be clear, we looked at SUVs from Porsche, BMW, MB, Lexus but none of them have the top rating and best repair service record as the Acura MDX.   BTW, if you are buying a car, ",
  "acura_mdx_2016": " Navigation system is mostly useless..better off not paying for it and using Wavz",
  "acura_mdx_2016": " What happened to Acura?  It used to be a luxury brand!  The 9 speed transmission cannot figure out what gear to be in.  And the ride is very bouncy!  Lot of vibrations when driving on the highway.  If you plan on spending $50k, I would look elsewhere.",
  "acura_mdx_2016": " I had also recently purchased the MDX and had the same vibrations as the previous post.  The story is the same - changed wheels, changed rotors, then balanced the tires.  They also decided to deflate the tires to mask the vibrations.  But I immediately caught them doing this and asked the dealer to  inflate the tires back to 35psi.  Acura is no help either.  Both Acura and dealership say this is normal variation of the MDX, and the lemon law does not apply since ",
  "acura_mdx_2016": " Very disappointed, follow up to my previous post, ok my car has been at the dealers 6 times now for a vibration between 55 to 75 MPH 4,900 miles they keep saying they have to confirm the vibration which I have a service order from October stating they confirmed the vibration, they replaced the brake rotors, needless to say vibration still there, they replaced the tires, vibration still there, took it back to the dealer today for 6th time, another test drive with the service manager he said he could feel something but wasn't sure what it was, back seat was vibrating extensively, service manager acknowledged it, said he would take a new MDX off the lot drive it same route we drove mine to see if the road made it vibrate. They called and said they test drove a new MDX off the lot and it vibrates worse than mine so it's a characteristic of the vehicle. They actually put this in writing on the service order. I asked if they were informing consumers of this vibration characteristic when they were looking at the vehicles and they said no, I told them just because the other car vibrates does not make it right, it sounds like a design defect to me, this  directive came from the District Service Manager I cannot believe they would actually think that is acceptable, they all vibrate so that makes it acceptable???? Buyer beware I would not buy the 2016 Acura MDX.",
  "acura_mdx_2016": " Overall it rides nice and very comfortable. The downside is that the Acura MDX has built quality issues. The panels either don't lineup or the gap is not even. For instance, the fuel door is off center, both side of the trunk lift gate have uneven gaps and both side of the front top fender panels are off and don't lineup with the front bumper. Very disappointed and I would consider other brand of SUV such as Lexus in the near future. If you are in the market for any Acura vehicle, do check for quality built issues. Chances are the panels don't lineup and the gaps are not even.The engine idle stop feature does not work at all after a few miles. In addition, don't even try to connect a smartphone because the vehicle does not recognize it no matter how hard you try. This is not what I anticipated for a new vehicle especially an Acura MDX. My conclusion is I would look to other brand of SUV before considering the MDX.",
  "acura_mdx_2016": " The ride is very comfortable and quite, acceleration for this size of vehicle is not bad.I found one issue with car: if you put the smart car key and smart cellular phone (iPhone) in the same pocket - your phone may not work or (and) you can't start car.This happened to my wife (she keeps her phone and car key together in her purse).",
  "acura_mdx_2016": " This transmission is awful!  Take your foot off the gas going down a hill and the car surges rather than slow down. Have to step on the brakes hard to slow it down.  Same issue when downshifting with the paddles.  Also stutters when going into drive.Voice commands are a joke.  I say find nearest ATM.  She says turn air conditioner up.  And so it goes.This is my third MDX but it is my last.",
  "acura_mdx_2016": " I bought a 2016 Acura MDX within the first week I noticed a vibration between 55 to 75 mph, at 459 miles I took it in to the dealer to install the mounding I had purchased and told them it had a vibration they balanced the tires. It did not solve the problem, took it back a second time where I was told by the service writer that there was nothing wrong with the car, I would find nothing wrong with it and it drives just as well as any car on the lot. You can visibly see the steering wheel shake and feel the vibration. I took it in a third time, took a service technician out with me, he witnessed the steering wheel shaking and vibrating. So I asked, ok we are in agreement that you witnessed the steering wheel shaking and vibrating he said yes, I took his name and wrote it down along with date and time. The dealer had my car for about a week, which they did give me a loaner, they called and said they had figured it out, they replaced the brake rotors. Needless to say the vibration is still there, since then I have taken it to a tire store that told me I had three bad tires, took it back to the dealer, they road force balanced the tires, vibration is still there. I have been in contact with Acura Client Relations since the second service appointment, next step is meeting with the District Service Manager. Not to mention how the transmission shifts, I am hoping they come out with a software update for that. Needless to say I am very disappointed and regret purchasing the MDX.",
  "acura_mdx_2016": " I hardly ever write any reviews but figured I just had to do one on this vehicle. I owned a 2010 MDX Tech, which was a great car, that unfortunately got flooded during Hurricane Sandy. Then, I got an ML350 and when the lease was up, we decided that we needed another 7-seat vehicle. So, as we'd already had an MDX before, we figured we couldn't go wrong with that one, right? Wrong! The first thing I noticed on my drive home from the dealership is that the car becomes ridiculously jerky while in traffic. The new 9-speed transmission just doesn't work well for daily city driving or when you're stuck in traffic on a highway. If you live in a rural area, chances are you'll never experience this. But if you're in traffic every day, well... you've been warned. I've adjusted my driving style since then and learned that switching IDS to ",
  "acura_mdx_2016": " We recently leased a 2016 MDX AWD with Tech Package. If we were to do it again the smart money would be the base awd model with the AcuraWatch safety feature package. Let me explain why....First off the car rides, accelerates, stops, turns, and everything else regarding moving extremely well. Even the headlights are exceptional. The interior seating design and the way they slide  is also great. The safety features shake the steering wheel if you depart your lane and warn you when other cars are too close.  Whats left is the way you interact with the controls in the dash and on the steering wheel. Every single thing about the interaction with the controls is unnecessarily complicated. In many cases it takes an extra click or 2 in a menu than in other cars. For example to turn seat heater on you need to click a button on the screen, select the heat level, then close the sub-menu. In every other car on the planed you click the button once to turn on the seat heat then another click to change the heating level. I consider this annoying, but not a deal breaker. Then you get into the gps. The gps takes longer than most to figure out how to do the basics. Its cumbersome to enter an address. The guidance is also poor. Sometimes there is no audible instruction on when to turn and a strange map of your turn with a flag that isn't always oriented the way you are travelling.  To sum it up you are better off placing your phone with google maps over the nav screen. I can only hope there is some kind of update to enable android auto or the apple car os. Last but not lease the Bluetooth connectivity doesn't play nice with my samsung galaxy s6. Every 30 seconds or so it pops up an error it can't import the phonebook. A quick google search indicates this is a common issue for many.  Then you quickly find out the text interaction is terrible. When you get a text a notification takes over the entire screen asking what you want to do (imagine you were getting ready to make a turn following gps). So then when you act on the notification you have to pick from a very small list of predefined reply messages. Every other car I have used including cheap rentals allow you to speak a text reply. My other vehicle is 2015 ram 3500 with uconnect and it does all of this with no issues.  In a day and age where so much of your interaction with a vehicle is the electronics acura needs to do a much better job. The kicker is you pay thousands extra for this tech package and get terrible tech bundled with some really good safety features. After having the MDX a few months I can say I would buy it again, but would not get anything above a base model awd with acurawatch.",
  "acura_mdx_2016": " It came down to the 2016 Volvo XC90, Honda Pilot, BMW X5, and 2015 Toyota Highlander.  We were inclined to get the XC90 for all the safety features , the incredibly cool look. The drive is great, however it felt really risky getting a brand new everything car.  The dealer had been saying they would get in Jan, the first ones did not appear till May and it seemed like they were trying to get it right.  Visibility was ok.  However, loaded with all the safety features it was getting to 60  though it starts at $47 all cars had very confusing option packages , what is considered a safety feature.  The test car 3rd row seat seem to have a problem. Then they recalled the vehicle to fix the third row airbags. We keep cars for 10 years , did not want to be going back to the dealer over and over again. The final straw is when they were offering factory maintenance for all models except the XC90 which had 1 year less of the maintenance.  On a new model they should not insert more doubt.  The BMW drove great but the 3rd row was not big enough for anyone over the age of 12 so had to cross it off.  The highlander felt less luxurious but most importantly did not have all the safety systems that we were looking for so we decided to pass. At the time the 2016 was not out, it appears from the reviews that they have added some safety features. We were left with the pilot and the MDX. In the end, the Pilot's cheap minivan arm rest on the drivers side along with the bad handling and turning radius on turns made us skip it.   Any man over 200 pounds will find there is no way to lean on the arm rest comfortably.  The turning handling and radius were a big concern also as on a sharp turn near our house the car veered into the oncoming traffic lane.  We did it twice.   Finally, unless you get the highest trim the handling is so ",
  "acura_mdx_2016": " I typically drive a vehicle for as long as possible. So when my 2003 Toyota Camry was starting to show some signs of wear and tear after 13 years, I decided to check out the new SUV's.  For me I wanted comfort, quiet, smooth handling, navigation package, something easy enough to get my aging parents into, and most importantly something with a solid reputation of being a reliable and quality vehicle.  My pros: I found that I liked sitting a bit higher on the road. The drive is very comfy, quiet and the vehicle is very responsive.  When I test drove the car I got the speed up to 90 entering the interstate before the salesman in the backseat coughed uncomfortably, but the car never hesitated and was very responsive. The headlights provide an amazing view of the road at night. The bluetooth for phone calls is crystal clear. I am using midgrade octane gasoline and I am averaging 24.5 mpg. My cons: I wish the cup holder was a smidge larger so it could hold my bubba cup of water. The navigation system is a little confusing but now that I am used to it things are fine but it took some patience on my part. The driver seat is self adjusting to driver 1 or 2 but I wish that I could get the seat to automatically move further back than it does upon going into park.  I understand that Acura has accessories for sale but I think that for the amount of $$$ you spend they could have included a net in the cargo area to keep the groceries from sliding around, I think it should have been standard not optional. Overall I really have been impressed so far and have not once regretted my purchase.  I don't have any maintenance issues to report after 4 months of ownership.",
  "acura_mdx_2016": " My wife and I were in the market for our first luxury crossover and we couldn't be happier with our purchase (Advance Pkg, SH-AWD). Let me say outright that we did not consider any German cars for reasons ranging from high price point/high maintenance to poor reliability/longevity. We weren't particular about having 3-rows, but felt it'd be nice to have the option (for trips with family/friends) - the MDX fit the bill perfectly. I've had my MDX for 6-weeks and driven 1800 miles, so its obviously too early to talk about reliability(which the Acura brand is known for) but here are the pros/cons as I see it.Pros:- Drives great. Plenty of power to summon in any situation (esply with Normal/Sport IDS modes).- Very comfortable seats , ride. You don't feel minor road imperfections , the suspension does a great job of dampening out big potholes.- Very quiet cabin. Conversation between 1st , 2nd row passengers have never been easier.- Gas sipper (I use premium 93 octane). I consistently average over 24-mpg in combined driving. Averaged 26-mpg during a recent 600-mile road trip(80% highway) with 5 adults, fully loaded cargo space (3rd row folded). That said, I always use cruise at highway speeds and avoid very hard acceleration/braking.  I calculate MPG estimates to be 100% sure though the tip computer is not off by much (-0.5 to +1 MPG off actual).- Realized the beauty of SH-AWD driving on curvy, hilly wet roads (yet to test on snow/heavy rain). Just when I thought I needed to hit the brakes to slow around a corner, the MDX breezes past with aplomb. It drives like a car - you don't feel body roll, side-to-side weight transfer during turns.- Love all the safety features, esply the Lane departure warning.  I read recently that it received great crash-test scores.Now for the Cons:- Depending on the gear you are in, the transmission sometimes seems to lag for a split second before it accelerates. I believe this has to do with dog clutch in the ZF-9 speed design. - Adaptive cruise may seem hard on braking/acceleration depending on how you normally drive.- Touchscreen response is a tad slower than I'd like it to be.- Fog lights are offered only as an accessory (extra $)- Power-folding side mirrors, panaromic roof,  motion-activated power liftgate not available.I've seen people voice concerns on online forums regarding transmission, build quality(as MDXs are built now in Alabama Vs Canada until about a couple of years ago)  but based on my experience, I'm inclined to believe most of them are unjustified. There have also been complaints about higher than usual noise coming from under the hood(for someone outside the car) even when the a/c compressor is not running -  the owners manual clearly says that is expected as a result of the system checks ! Complaints related to dual-screen is a matter of getting used to - I actually find it convenient. The 3rd row of seating is mostly for kids (or short adults for upto 2-hr ride). In my opinion, this is the most well-rounded luxury crossover offering an optimal mix of comfort, handling, value and safety. Get one - you'll love it !",
  "acura_mdx_2016": " Purchased my MDX'16 (SH-AWD Adv/ Ent.) 3 months ago. So far so good. Great handling, smooth riding SUV. Quiet and comfortable on the road. Very responsive in sports mode. The infotainment system was not simple to use at first, but when I learned how to use it, I really like it because of its cool advance tech. features. Great sound system. Excellent Rear entertainment system with wide screen that produces a surround sound quality similar to a high end home theater system. Safety features are probably one of the best in it's class. The adaptive cruise control/ lane keep assist are great feature on long drives.Follow up review: after 9 months. So far so good, still an excellent vehicle. no major issues. I really like the push button shifter. Contrary to some reviewers complaint, doing a three point turn is an easy step for me: put the hand over the gear selectors, pull the reverse button to back up with the index and middle finger, push the drive button with the thumb to forward, no arm travel is needed. One minor issue is the back up camera was slow to respond. Just like some of the reviewers here in the site, I also noticed that ocassionally, the drive in lower gear is not smooth particularly in sports mode, but it's not a big deal, for me it has similar feel when driving a manual trabsmission car at 1st gear.Highway mpg is spot on, 26-28 in long drives at 60-70 mph on a flat road. City is around 19-20.The lane keep assist can keep up at 45-65 mph when there is a clear lane marking, at 75mph, I noticed that the car gets too close to the next lane when going on a curvy free way. Adaptive cruise works well in my car but can slam on brakes a bit hard in some occasions particularly when there is a slowing down of traffic in front of you. Not quite as smooth as a human driver braking.To me, the dual infotainment system is cool and high tech looking especially now that I'm used to it, but could still be improved to a nicer, faster, HD graphics. I wish Acura could come up with software upgrades in the future.",
  "acura_mdx_2016": " We finally bought our new SUV or I guess they call it a crossover. Keep in mind we only have a few hundred miles on it so its still really early. We looked at a lot of vehicles before choosing the MDX. As far as a luxury 7 passenger vehicles go this seemed to have everything we wanted and needed after a couple of weeks of shopping and doing serious looking at the German counter parts. The MDX meets all of our requirements as follows in no specific order. Luxurious, stylish, roomy, safe, quality. We hope the maintenance is low and that it will hold its resale value I guess time will tell. The ride is great in the awd however on bumpy roads you can hear some road noise. The steering is awesome The turning radius is amazing making u-turns a breeze. This is a very easy and stress free vehicle to drive. Unlike most of the reviews I have read the command center is easy to operate we were a little worried after reading the reviews but it is super simple! We thought we wanted the black on black but after looking at the Lunar Silver Metallic we fell in love with how it really accentuates the lines on the vehicle.",
  "acura_mdx_2016": " After 1000 miles the new 9 speed transmission can't figure out what gear to use at low speed ( 40 MPH). The ride is jerky or the car surges. The dealership is aware of the problem, but solution not available. Also the memory seat/steering doesn't always return to the set drivers position and the navigation system worked correctly 1 out of 4 attempts. Knowing what I know now, I would not get this car.",
  "acura_mdx_2016": " After owning several BMW's, Mercedes, and lastly a Jeep Grand Cherokee, I decided to look at Acura due to its quality reputation and value.  A comparable BMW or Porsche would have cost 20K more.  I was immediately impressed with the comfort, quality, and performance.  Although not as sporty as BMW products I have owned, it drives and corners smartly.  Probably the quietest vehicle I have owned.  After many dealership visits with the Jeep, I look forward to years of routine service only with the Acura.",
  "acura_mdx_2016": " Before buying, I test drove a 2016 Pilot EX-L and a 2015 MDX. In my opinion, the MDX felt more agile and responsive than the Pilot, and I preferred the MDX's interior and exterior styling over the Pilot. The Good:Car handles incredibly well. Accelerates, turns, and brakes superbly. If you're looking for a three-row SUV, I can't think of anything that would come even close to the same level of performance and value, except perhaps a Pilot. The only other option I considered was the Volvo XC90, but it would cost around 25-30% more, and although I greatly prefer the Volvo's interior and user interface, my friends with Volvos have had issues with reliability. Audi Q7 also looks great, but again price and reliability issues steered me away. So, from a price-performance-reliability standard, the MDX is very hard to beat. I took the MDX on a curvy, secluded mountain highway, and it was truly the most thrilling drive I've ever had. I'm happy with the car.The Bad:The user interface is disgraceful. Acura's worst yet, and that's saying something. Even though the dealer set up the car for my wife and me, my wife's first solo drive in the car had  her near tears because of the maddening user interface. For instance, getting the car to accept her phone's bluetooth connection instead of mine was crazy complex, and you have to go through two entirely separate menus if you want to transfer both the phone operations and the phone's media (e.g., Pandora) from one source to another.  Even everyday tasks like turning on the seat's heaters, adjusting the A/C, or tinkering with the audio settings (e.g., fade/balance) all take multiple levels of menus, requiring too much of the driver's focus and attention. I sorely miss when I could do any of those things with a single gesture (flip a switch! turn a dial!) without having to take my eyes off the road. Now, I have to find the 1 cm square on the display panel that takes me to the menu to adjust the fan. Then the menu changes, and I have to navigate my hand to the ",
  "acura_mdx_2016": " We looked at numerous SUVs and Sedans but kept coming back to the Acura MDX.  Build quality, fit , finish, ride comfort, interior materials, driving performance and styling were equaled only by several of the other Japanese auto makers.  Acura was the only one with a dealership nearby so it wouldn't be a hardship if the MDX does have problems in the future.  This is our fourth Acura so we do have some degree of owner loyalty.  Both of these factors weighed heavily in our decision on which SUV to purchase.However, there are several things that we do not care for and they are as follows,  the automatic stop/start feature is a nuisance (and it cannot be disabled), navigation system and driver / vehicle interface is cumbersome  and complex.  You're better off just learning to use the voice prompt for most commands.  I prefer the Bluetooth connectivity in my 2011 Ford truck than the Acura phone system.  My wife has learned to use Siri on her linked IPhone to make calls from the MDX's Bluetooth connection (it's easier than their system, at least in her opinion).We drove both the two wheel drive and SH-AWD versions and I can say for a fact that the AWD option handles and performs MUCH better in a hard rain.  We typically don't have any snow or Ice in this part of Texas but my guess is that the AWD would do just as well in those driving conditions too.  Another consideration is that when the SH-AWD option ($2000) is purchased, you also get a spare tire and jack.  If you buy these items separately from the dealer they are $510.  The two wheel MDX drive DOES NOT COME with a spare tire. The multiple versions of ride control (e.g. IDS, Comfort, Normal, Sport) are wasted on us.  Why would anyone want to drive a glorified station wagon in Sport Mode, the MDX is not a sports car!  Acura could get away from having to install the VERY expensive magnetic shock absorbers currently in use but I suppose if that's what the competition is doing they have to do it too.Transmission, shift points, smoothness, etc. all seem to be set OK for normal to moderately aggressive driving.  We really like the transmission push buttons in lieu of a ",
  "acura_mdx_2016": " Purchased: 2016 MDX Advance. This is my second MDX (my wife's car) and while I am big fan of the vehicle, Acura made some horrible tweaks to the car.  If I were to buy this car again, I would try to find a 2015 model.r Pros:  The interior is beautiful with great materials.  The ride quality is excellent and always gives confidence.r Cons: The are 3 man issues with this carr1) The transmission is truly horrible.  I am car guy who has owned many cars and have never experienced such a bad transmission.  PLEASE release a software update to fix thisr2) The auto-idle is poorly executed and there is no way to permanently turn it off.r3) Infotainment system is dated and the GPS in mediocre",
  "acura_mdx_2016": "Interior is great.  Remote start feature is worth the money.  The safety features are good (the reason I bought this car) even though they are a bit intrusive.rnI would stay away from the Advance model and just get a Tech with the AcuraWatch Plus.rnrnAdditional Con: I didn't have room above or below so I also wanted to comment on the new shifter buttons.  You have to look at them to make a change and they just seem like an extra step.  I also used to rest my hand on the shifter which I can no longer do. rnrnIf Acura doesn't do a better job of implementing their changes then I will be looking elsewhere when my lease is up.  ",
  "acura_mdx_2016": "1. Reprogram the transmission.  Driving under 25 miles an hour (my town's speed limit) feels like there is a drag on the engine and the shifting is not smooth.  Putting the car is sport mode (which my wife did by accident during her first drive) makes the car buck and jerk at low speeds.  Did anyone at Acura actually drive this car before releasing it?rnrn2. Fix auto idle or allow for it to be easily turned off (permanently).  I have rented many cares with this feature and this is one of the worst implementations.rnrn3. Acuras used to be known for their great technology.  The infotainment system is really dated.  Why hasn't Acura rolled out something like the head unit in the new Volvo XC90?",
  "acura_mdx_2017": " My MDX top rear spoiler is damaged and when I went for a replacement, there is no spoiler available in entire USA and Acura wearhouse. They can't guarantee when it will be avialable. It might be 1 month , 2 months or a  year. Such is the service of Acura. It's really frustrated my that they can't maintain parts inventory.",
  "acura_mdx_2017": " Definitely a reliable safe SUV that you can depend on for years.  Great price point that you can't pass up.  Although Acura puts out great reliable cars I always purchase the extended warranty from either the dealer or credit union.",
  "acura_mdx_2017": " Good gas milage, loaded with features and very affordable.",
  "acura_mdx_2017": " It's nice design exterior and interior, smooth ride. 9 speed transmission shifts great in Normal driving mode . Great fuel economy for size. Tighter third raw",
  "acura_mdx_2017": " We just acquired a new MDX from Bloomington Acura and Edward Kaspustin. A truly great buying experience. Edward spent a great deal of time before and after the purchase going over the MDX and its features and followed up after the purchase to see how it was performing and how we liked the vehicle. Outstanding",
  "acura_mdx_2017": " I have liked the look of the MDX for over 15 years. The MDX was in the final 2 of my selection process but in the end the technology wasn't as smooth and sleek in presentation as the vehicle I purchased. The MDX also drives like a truck and I selected a SUV that has a more sporty drive. I have teens that are now driving themselves and I don't need a third row however the middle row captain chairs make the MDX functionally a 4 person vehicle which was a negative to me. Finally, the price is high compared to the new sporty Mercedes GLC 300 which was my final selection.",
  "acura_mdx_2017": " I cross shopped multiple vehicles prior to purchasing this SUV. My wife and I sat in and drove many SUVs. We felt like this SUV offered a lot more than the others for the price. The biggest/best surprise is the SH-AWD (google torque vectoring if you haven't already) which makes the car a lot of fun to drive and adds a spare tire. The ELS sound system is great. The safety features should be standard on all vehicles -- the technology package adds the blind spot detection which is awesome. I was worried that the transmission would at least take some getting used to given the complaints but it's great actually. Their are plenty of YouTube videos explaining why it feels a little funny between 2 gears but I have honestly not had a problem in any IDS mode (sport, comfort, normal). The complaints don't seem to be primarily regarding reliability. I was also worried I wouldn't like the shifter after so many complaints. It is actually very easy to use and keeps me from ever having to look down. It has the added benefit of protecting you from changing gears when you shouldn't (i.e. P while driving, D while shutting off the engine, etc...) which ultimately saves wear on your transmission. Good warranty compared to the other SUVs (7 years on the drive train). The infotainment system is just ok even with the tech package but has all of the functionality I need. I wish that it had a panoramic sunroof. If you compare to other vehicles in the class, for example the Lexus RX, Audi Q7, Volvo XC90 etc.. or even the Pilot, Pathfinder, Highlander, and Forester, I thought the Acura was ultimately the best bang for your buck.",
  "acura_mdx_2017": " This car has a surprisingly blurry backup camera. Taken back for adjustment/replacement and the tech said ",
  "acura_mdx_2017": " The styling, handling, and safety features are the biggest improvement over previous models.  The addition of the chrome to a black MDX makes it look sharp.  The added safety features are vastly improved. The tranny could be a little smoother. Pairing an android phone can be a tricky situation.  Overall a very good choice for a family or if you need cargo space. Set your cruise control to normal instead of adaptive and set your tranny to sport mode to improve your driving comfort.",
  "acura_mdx_2017": " Super car at a great price the advanced package as every thing you could ask for in a SUV heater and cooled leather seats.Super ride and power, plus a a lot of other features that are just too many to list",
  "acura_mdx_2017": " I've owned it for about a month and from all my experiences so far, I'm very impressed with quality of interior as well as luxury feel of the car. I've driven German cars for the last 5 years and decided to go back to old reliable Japanese-made cars and couldn't be more relieved. After spending a ridiculous amount for maintenance on my 328 iX Drive, looking forward to owning this car and not worrying about the next pothole or the next maintenance project that will cost thousands of dollars.",
  "acura_mdx_2017": " ",
  "acura_mdx_2017": " Love the car, though it has only been a month. For price the fit and finish is fantastic and the active safety features are very good. Electronics are good, though some are tricky to learn.",
  "acura_mdx_2017": " Overall, an excellent piece of engineering and design. It's not 100% perfect on design, but it's pretty darn close.  Let me summarize simply with Pro's and Con's. PRO'S are: Awesome handling with SH-AWD, I mean really awesome. Just about as good as my E92 M3, I totally mean that, for all intents and purposes on the street. The semi-autonomous driving features are great. The Lane Keeping system, the Adaptive Cruise Control with Follow, Blind spot warning, all make it ALOT safer to drive in these days of distracted driving. You must study the functionality of each system to know when you can and should not rely on them. But overall I find them productive and adding to safety for me and those around me. Comfort is 8.5 of 10. Seats are not super duper, but definitely more than acceptable. You can customize the crap out of all the systems, and if you read the 500 page manual like I did, you will be amazed at what this car can do. Walk away auto locking system is quite nice. WIth the right setup in the menu, you never, ever have to take the key out of your pocket/purse. Just walk in, walk out, the car does exactly what you want, when you want it, and you just never touch a button on the remote, EVER.  Worried about the car being locked? You can send it a message via your remote, querying the lock status, and I've tested that at 100 yards remote distance, no problem! Engine is satisfactory - it ain't a Porsche, BMW, but it gets the job done. The 9 spd tranny does fine! All these complaints about transmission hunting around for a gear, but I have not noticed it.  Auto engine stop awesome, auto brake hold system awesome. Headlights are freaking amazing, SO BRIGHT.  Sound system is 8.5/10. I have heard better, but this is totally fine. Mileage is pretty darn good, on a freeway going about 65  you can easily get 25mpg if not closer to 28-29mpg. CON'S: the navigation system sort of sucks, compared to Google Maps. You can't beat Google with it's machine learning and real-time mobile updates on traffic etc. Plus the processor powering the Nav and the Phone menus is slow and outdated. But usable if you have to. One huge con is for USB flash drives, the search functionality is AWFUL, as you can only scroll the huge list of songs or folders, you cannot search by Artist, Title, etc.... If you want to bring your own music, you better have a large iPOD, in which case the Search/Selection functionality is reasonable.  OVERALL: definitely a car you will enjoy taking road trips with.",
  "acura_mdx_2017": " I'm own 2014 mdx and trade for 2017 Mdx. This 2017 Mdx look/ride and more smooth  better than 2014. With the technology pack. love it more for the money been drive a week and still love it and I think this car gonna last for awhile for me",
  "acura_mdx_2017": " Before you buy this car, try the electronic system with the caveats belowI have been a loyal buyer of Honda cars for years. However this will be my last purchase from them. I have an 2017 MDX. The GPS and entertainment system is unusable. Don't take my word for it try it before you think about a purchase.GPS does not work- If you try take a different turn then directed on the route, most GPS is will recalculate and redirect you. Not this system. They have made a design change where the GPS will actually direct you off the road. Apparently my dealer tells me that they know about the problem for a long time and hoping for a fix. The car does not allow you to cancel the route as you are driving.The voice activated commands absent do not work. Dealer says they know about this. They tell you not to use the voice activated system.The dealer tells me that the MDX system is not entertainment compatible with iPhone (somewhat odd given their popularity).",
  "acura_mdx_2017": " I agree with previous post the transmission sometimes is jerky.  Also when you turn the wheel it makes a noisy grinding sound.",
  "acura_mdx_2017": " Love the car except for the transmission. Poor performance for a quality vehicle.",
  "acura_mdx_2017": " The MDX with the tech package has everything you need as far as safety and comfort. We added thee otional heated steering wheel sunce we live in the northeast. Great vehicle worth every penny!",
  "acura_mdx_2017": " Excellent ride and performance. Fit an finish not consistently excellent (lift back alignment not up to luxury standards on my vehicle) but this is nit picking an otherwise very solidly constructed vehicle. Previous Acura product (2000 TLX) lasted more than 15 years and 300k miles. Brand is very reliable and safe choice. Most people will be very happy with the MDX. An great value!",
  "acura_mdx_2017": " This is a great car for the price. This is my third MDX since 2001 and I put many miles on a car. With regular maintenance, this car can go at least 200.000. A very stylish ride.",
  "acura_mdx_2017": " I am replacing my old CRV and so far, so good. I will post again after I got more experience with this model.",
  "acura_rdx_2016": " I was looking for an SUV which is smaller then 6 seater but bigger then an average sedan. This car ia great! its very powerfull and acceleration is quick. There are plenty of room in a trunk. The only problem I have is that, I cannot get comfortable in the driver seat. I'm 6 feet tall ans struggling to find a proper ratio. If I move the seat too far back then my hands become stretched out, and If I pull it closer them my knees ",
  "acura_rdx_2016": " If you live in rural areas, RDX is your good choice. You can easy passing any car when you up hills. But you still got good mpg. I drives mostly highway. I got 24mpg.",
  "acura_rdx_2016": " Very comfortable, more than adequate power, a pleasure to drive, especially on the open road. This suv could easily go all day smoothly and quietly at 80 mph. No maintenance issues so far.",
  "acura_rdx_2016": " i love my RDX . Best car for that price . So quite and comfort ride",
  "acura_rdx_2016": " This vehicle is fantastic!  I test drove a Ford Explorer, Nissan Murano, Hyundai Santa Fe and I bought the RDX with the tech package.  The reliability reviews over the others was one of the main points but after owning it I really have come to appreciate its high points.  The ride is smooth, powerful and really quiet.  The sound canceling system (like Bose headphones) does a great job. Being a musician, I was impressed with the stereo and during my test drive we adjusted the base and subwoofer to full potential and I was blown away.  The sound quality with the ten speakers in neural mode (surround sound) is amazing. Some reviewers complained about having two screens.  I prefer it and it's much more pleasing to be able to still see your audio screen while navigation is showing on a different screen.  Brilliant!  They recommend 91 octane which basically doesn't exist anywhere so I need to use 93.  I'm not thrilled about that but at least gas is cheap now.  I drive both highway and city to get to work so it seems I'm averaging around 19 mpg. No long trips yet to really see highway mileage. I live in South Florida and I can say that the air really cranks.  Most of the time I only have the fan halfway even though the leather seats in summer can be hot.  The advanced package has ventilated seats but will cost you at least $3500 more on your out the door price.  I passed.  The shortcuts menu, speed dial options, voice prompts and other technology is a big plus.  I went from a stupid car (Honda Accord 2007) to this so it's like walking onto the Enterprise!  I can't imagine anyone buying this car and not liking it.  I paid $40,000 even out the door which seems to be a pretty decent price for a 2017 with the tech package. Updated11/3/2016. I can now confirm highway mileage on a long trip at 29 mpg which is as Acura estimated.  I like this car even more now as I've been using more of the bells and whistles. I REALLY appreciate the back up cross traffic alert.",
  "acura_rdx_2016": " Great ride. Dont take that as its a sports car, its not. Just a great cruiser and if you want some fun slip it to sport and use the paddle shifters. Biggest complaint is the voice regonition. Only had it a month but it takes some work to master, and i havnt , and not sure i ever will. Best way is to put in an address before you leave, trying to find a certain restaurant etc on the go gets frustrating. I get better mileage than stated which is a nice surprise. Love the blind spot detector and the backup camera is awesome, really gets a wide view which is great. I am not disappointed with this suv at all, just the oppisite. Best bang for your dollar by far. Oh yeah the seats, especially the cooled option are the most comfortable of all the higher end SUVs, at least for me. Everyone has a different butt and back but for me its like sitting in my lazy boy.",
  "acura_rdx_2016": " the good stuff - overall a very nice ride. Good safety tech, stereo, looks and power. Stable at speed and good mid range power. Lane departure warning and adaptive cruise control are a great feature. Looks are very good. Stereo sounds very good. Seats are excellent, heated and cooled. dual zone climate control.  Several of the electronic features are very helpful.         The  not so great stuff - Transmission hunts a bit at low speeds on occasion, the nav system is a pain trying to use voice recognition to get a location. Still cant figure out how to just enter an address manually. Mileage is not as good as I had hoped but, mostly city driving so far so may improve.  It came down to this and a Lincoln MKC with 2.3 turbo. the Lincoln was faster and more luxurious but, went with the Acura for better resale value.",
  "acura_rdx_2016": " What a waste of time and money for a ",
  "acura_rdx_2016": " Pro: Most of the parts worked very well. Con: The transmission is not as smooth and sometimes jitters found at low speed start, especially when the engine is cold.Other thought: Wish the screen for backup camera could be 6",
  "acura_rdx_2016": " Traded in a 2006 Acura TL that was really a great car and tremendous value. Would have kept but needed an all wheel drive vehicle due to moving north into snow areas. The RDX is a high quality ride and as always with Acura....reliable and great performance. The ride is smooth with tight handling. Mileage around town is 23-24 and on the road 31-33 depending on terrain.  Interior fits well with a normal size person and everything is within reach easily to see and operate. You won't be disappointed with this vehicle.",
  "acura_rdx_2016": " Can't beat the value",
  "acura_rdx_2016": " This is my 2nd RDX. The first was approaching 10 years old original owner no problems aside from normal maintenance items. The 2016 RDX has come a long way -  is extremely comfortable fun to drive and loaded with Technology and safety features. The adaptive cruise and lane keeping assist work very well. If you're in the market for a reliable new car with state of the art technology this is one you should take a good look at. While i'm not big on extended warranties, especially not having any issues with my first RDX, they did sell me on a transferable 4 year extended ",
  "acura_rdx_2016": " Outstanding options and value with our new 2016 RDX. We traded in an 08 RDX and it was such a great vehicle when we were in the market for a new one it was an easy choice. The new safety features, smooth ride, better gas mileage (even though it much bigger) and price compared to a BMW or Lexus was a no brainier decision. You will not be disappointed with this vehicle. Love it , thanks Acura for a great vehicle.Dave",
  "acura_rdx_2016": " Very comfortable ride, VERY roomy, safety features are excellent, technology pretty good, will definitely stay in the Acura family, they have yet to disappoint me!! Also would like to inform buyers that I had the best experience ever @ Acura in Gainesvillexe2x98xba",
  "acura_rdx_2016": " This is my 4th RDX. I love the car. Everytime my lease comes to an end I look to see what's out there and I can't find a better car at a better price.",
  "acura_rdx_2016": " Maps are at least a year out of date on my brand new car.  Can't be set to go to a city center like my 10 yo GPS, rather needs a complete address.  Ask for a fast food resto with multiple locations, and the order of presentation is screwy.  Many times misunderstands verbal instructions. Today it could not map a location for an address it found.",
  "acura_rdx_2016": " It may not be the best vehicle in each and every category in its class, but when you weigh the pros and cons of the competition, it comes out on top. The factors that I look at in an SUV, are ride, performance, styling, interior room, resale and reliability. Sure, if money wasn't a factor, I would have chosen an Audi 6 cylinder Q5, or a BMW twin turbo X3. I just don't see $10,000 to $12,000 worth of difference. Keep in mind most of the competition comes standard with 4 cylinder engines. The RDX has surpassed my expectations in my early ownership, and I suffer no buyers remorse. My only issue is that I had to pay $468 to the service department for a ",
  "acura_rdx_2016": " Don't waste your time even looking at the other SUVs.",
  "acura_rdx_2016": " While there were some high points with my 2016 RDX, all in all, it was the worst $30K+ vehicle I've ever owned.  First and foremost, the electronics in my vehicle were so buggy and unreliable, it became positively maddening.  About 1/3 of the time, my hands-free calls would fail to connect and leave the phone in ",
  "acura_rdx_2016": " The RDX probably isn't the best vehicle in the small luxury SUV category in any particular attribute, but it does score near the top in most attributes, and it's that, combined with a price $10,000 or more lower than similarly equipped competition, that makes it a great buy as well as a very enjoyable vehicle.  We've found it very comfortable on a long road trip and around town.  We also feel that the understated styling will endure over time without looking odd or dated.",
  "acura_rdx_2016": " Great car to drive.  Adaptive Cruise, lane change warning and other safety features are just awesome.  Brakes are terrific.  Compared to our Lucerne, road noise is much worse, but tolerable interior is not par w/price.  Ride is pretty good for suv.  Acura cheaps out on some features that will annoy you every time you drive it.  For the RDX, only one of the two key remotes w/the applicable pkg will start the car.  With the MDX, both remotes will do it.  Guess Acura saved a couple bucks to hack off customers.   Bad design is driver seat position.  Our Buick had it right..seat went all the way back when ignition turned off, making getting out really easy, after getting in, push driver 1 or 2 and seat, outside mirror, and interior mirror repositioned.  With the RDX, using the driver 1 or 2 setting, the seat positioned PRIOR to getting in.  For us short people, that made getting in difficult.  The inside mirror also was not among the setting.  We had to disable the seat positioning setting.  A really bad design.  Door panels are sorta cheap also.  Overall, a nice car, fun to drive but some cheap outs.  Not worth the price..but close.",
  "acura_rdx_2016": " We traded in a 2004 Acura TL for our new 2016 Acura RDX.  My husband and I are Senior citizens and found that the RDX was easier to get in and out.  It has the Acurawatch feature which helps us drive our curvy back roads where we live.  All and all, its beautiful!",
  "acura_rdx_2016": " This is a really great car.  I got out of a BMW X5 for this one and the RDX is way better than my old bimmer.  The main thing I was looking for was a silky ride with a very quiet cabin.  I get both with this RDX.  The power train is exceptional with the standard v6.  The cabin is very quiet although sone what less so than Edmunds reviews said.  Where Edmunds gave it an ",
  "acura_rdx_2016": " Purchased the 2016 RDX advance which comes with nice tech features. Ride is comfortable on highway, punishing on bad pavement or potholes. Also what Acura claims are rain sensing wipers is false.they must be turned on and off manually each time it rains.as if left in Auto position, they continue to wipe even if dry.otherwise no complaints. Good car if you don't mind feeling every pebble on the road, but my last car was a Lexus so I may have been spoiled.",
  "acura_rdx_2016": " really nice car. All the options for less than competing vehicles and a 4 year warranty. I love it",
  "acura_rdx_2016": " Very nice comfortable ride",
  "acura_rdx_2016": " Totaled out our 2016 RDX, replaced it with a 2017 RDX, love it.",
  "acura_rdx_2016": " We purchased car January, 2016 - love it - first new car in a long time and very happy with purchase even though it was on the high end of our budget.  Car is very comfortable to drive and is made well.  Technology is very easy to figure out and has lots of cool features.  Took ride up to Minnesota and ride was very stress free with cruise control system features.   Smooth quiet ride.  Some reviews state navigation system is cumbersome and at times it is, but no different then using a Garmin.   Sound system is great and love the HDD CD Drive.  Even though dealers do not deal much in price we found a much better deal at an Illinois dealer vs Milwaukee area and they were great!  Hope we get lots of years out of it and it holds it value.",
  "acura_rdx_2016": " Great look. Drives very well. Very disappointed that at this premium price for an upscale SUV the sound quality is mediocre. The Bluetooth keeps on dropping the calls and the phone sound quality is poor.",
  "acura_rdx_2016": " Excellent all around. Steering a bit soft. Paddle shifter really smooth, and really helps in winter conditions",
  "acura_rdx_2016": " The technology package is all the sales people talk about, but so much has been removed from the luxury of previous models.  The chrome-look has been removed from most of interior, the navigation box is too small and the touch screen is difficult to operate.  The luxury is gone, interior looks and feels smaller, doors even feel lighter.   The front of the vehicle has been redesigned and looks great, but everything else was too significantly flawed to hold my interest.   By comparison, very disappointing compared to the 2014 model I previously owned and way overpriced.   I chose not to purchase.",
  "acura_rdx_2016": " My wife never had a SUV and wanted one to be our next one. She has been driving an 08 awd Acura RL and loved it. We put snow tires on it for the winter and it was a tank in the snow with the SH awd. So for us to trade it in was a big deal. I started doing some research on Edmund's and started to list the suv's we should consider. I test drove over 12 myself and reduced it down to 5 we should consider. We decided to stay in the mid size or smaller range since it is just the two of us. We picked one day to test drive all 5 for comparison. The Lexus NX and RX were the first she drove. Next she drove the Acura RDX then the Hyundai Tucson and Santa Fe. The RDX beat them all with the 6 cylinder engine, it was by far the most peppy of them all and drove more sporty than the RX. It seems like everyone has an RX these days so they are kinda of boring to us. The RDX is full of technology which has been greatly been improved upon since we had it in our RL. The biggest is the blind spot, auto braking, cross traffic and adaptive criuse control. I have using them and they help greatly with driving. We are happy with our decision and have found acura's hold their resale value as well as being reliable. By the way, the Hyundai Tucson was our second choice, which we may buy as a second car in the future. It is about $10000 less than the RDX and has alot of the same features.",
  "acura_rdx_2016": " I bought this car because the ride is quiet, the acceleration is excellent, the ride is comfortable, it has a very good safety rating and safety technology is state of the art. I also liked the Acura's reputation for reliability. I enjoy a good sound system and the RDX with the Advance package is among the best I have heard in a car. We drive a lot of miles each year on long vacation driving trips. Since the car is also used around town, the smaller size of this SUV is convenient as it rides well on a trip but also easy to park in a city.  There have been a couple of surprises. While I knew the car had great safety features, I had not really experienced the changes introduced to my life by this car until taking it on a trip shortly after buying the car. The surprise is that it requires changing how to drive in many respects and requires a new driver for this car to adjust to the technology.Specifically, the ability of the car to adjust its speed with the traffic. Don't misinterpret: I like the changes but on a busy interstate, one needs to pay attention to adjust to the changes. Cars and trucks pull in front of a car unexpectedly. The first time this happened, the Acura RDX slowed dramatically and automatically. I did not have to apply the brakes. Several days into this driving trip, I had adjusted and found myself becoming almost lackadaisical about this feature as the car almost adjusts itself. Driving is more relaxing. On a busy highway, I disabled the system though as the distance between my car and the next vehicle was long, even with the lowest setting, and occasionally a large number of cars would continually pull in front and constantly slow down our pace of driving.I did not like the feature of adjusting the steering  when changing lanes or moving in traffic. I turned this feature off quickly. No doubt, I will try it again but doubt it will be useful or one that I will use with any regularity. I prefer to drive the car and change lanes as necessary without objection from the computer in the car.My biggest complaint in an otherwise excellent vehicle is the navigation system. I don't like it or how in integrates with the other system technology. The navigation systems in previous cars are much better. The Acura system is not intuitive or designed with the driver or consumer in mind. It works with the voice control but the list of possible commands is long and ignores some of the most common features available on other vehicles.I still do not know if I can send instructions to the car to follow a route I have created on the computer. The Acura site indicates I can do this. The salesman who sold us the car said he had never heard of that feature. A system like this works well on a Mercedes that I own. The manual is silent on on how to do it. The website offers no advice. I do not mind making a call with Acuralink to enter the destination but would prefer to map it out myself to select my own routes.The ability to use the smartphone with the Acura's system is an excellent innovation. I also like being able to stream a podcast or Pandora through the stereo system. Sirius XM generally works well with the Acura although the traffic and weather features do not integrate with the RDX. We used those features extensively with a 2012 Murano and this lack of integration is a significant failing of a luxury SUV. There is weather and traffic information on the RDX, it is not up to Sirius.Unfortunately, the navigation system operates in its own universe. The voice system giving directions cannot be heard clearly while sound is coming through these other systems. Instead, the systems yammers away incessantly with turns and directions while leaving the stereo system as a higher volume. Moreover, attempts to turn down the navigation system with the voice controls apparently cannot be done. At least I have not found a way to do this or to find in the documentation how it can be done.In my older Murano, I was able to know when the next rest area was coming up as well as when the next exit was coming up. Not so in the Acura. Asking for rest areas results in a list of rest areas, some of which may be behind on the route being traveled or may be many miles ahead. The information is useless. One friend who bought an Acura said he gave up and bought a Garmin navigation system to use instead of the built in system. I now know how he felt and I am inclined to agree. The nav system in the RDX is a major disappointment. As a person who uses a system like this extensively on trips, I have already found using Google maps or Waze on my IPhone to be much more useful and easier to use. With an MSRP of $45,000 for this luxury SUV, I expected much better. Moreover, the Acura salesman was not well versed in how to use the system so learning how to use it has been largely trial and error and stopping occasionally to check the manual to see if we missed something that would make it more useful.",
  "acura_rdx_2016": " Owned the 2016 RDX for 2 months.  Bought the FWD with technology package.  The RDX has the best overall engine for small SUV.  Same engine as the MDX, but much smaller car means better performance.  Great HP for its class.  Very good gas fuel economy and uses regular unleaded gas.  Other SUV's that had similar HP were turbo charged engines that required premium gas (i.e. more expensive to operate).  Transmission is 6 speed automatic that is very smooth and shift points are perfect.  Ride quality is a little stiff, but that helps with handling.  The car is very quite when windows are rolled up.  Seats are very comfortable.  Very nice dual displays (one of which is touch screen).  Premium stereo with XM and HD FM.  I like the HD FM sound quality.  It has a 15GB hard disc so you can save CD's or transfer songs from USB stick.  There are 2 key fobs that you can customize most of the car features for each.  Seating position, radio settings, navigation settings, are just a few of the items.  Car recognize which key is closer and those settings are active for that driver.  Very nice.  Only a few negatives:  Lots of wind noise when back windows are down more than about 1 inch.  The electronics take about 1 minute to boot up when you start the car.  Does not sound like much, but much slower than my Lexus that is 8 years older.  Navigation system works good, but a little funky to set.  Sound quality is good compared to standard quality systems, but less than other premium systems.",
  "acura_rdx_2016": " This is my 2nd RDX. My first was a 2014, which I was happy with, despite a few minor irritations. The 2016 took care of my irritations with added technology, specifically the blind spot and rear traffic warning sensors and changes in the technology package. The RDX has two good blind spots so the new tech is fantastic and solves the issues - and works beautifully. The 2016 feels heavier and drives smoother than the 2014. The steering feels better and more substantial, as well.  It is also quieter with less wind noise and a smoother sunroof mechanism.   I did purchase a wind deflector this time though. I love the 3D navigation viewing option and the 10-speaker sound system is wonderful.  I've had Acuras since 2000 - three TLs (2000, 2003 and 2008), the 2014 RDX and now the 2016 RDX.  My 2000 TL had transmission issues, which were taken care of by the dealer even though the warranty had expired. I've always been treated well by the Dealer (in South Orange County in California).  I did not test drive competitors' vehicles, but did a lot of research on the Lexus RX, Lincoln MDX, Mercedes GL and GLK and some of the BMW and Audi SUVs, which would have fit into my budget. At the end of the day, I could not justify a higher cost for the competitors (when comparing the multitude of packages available with the competition), even though they may be more prestigious in name and perhaps more luxury interiors.  The value, quality and solid luxury of the Acura won out when I decided not to tie up more of my money and still have all the bells and whistles you get with the RDX.",
  "acura_rdx_2016": " I love this car very much, and I really want to give it a 5 stars review.  However, the breaking system seems not responsive enough, I have to press harder in order to make it stop.  Within a month, I heard noise while I hit break this morning, within a month!  The noise was gone when I drive it during my lunch break, maybe it's the temperature, but still, it shouldn't do that because it's a new car. Also, the engine is so called ",
  "acura_rdx_2016": " This is our 3rd RDX and I must say the 2011 was best the best handling and most fun to drive although kinda choppy. I liked that, wife didn't. We got the advanced package and the tech is way much and rather complicated for her. It's her car and she likes it. Got the advanced because of parking sensors front and back and nicer rims. Biggest complaint was the lack of color selection (did away with silver-now slate silver BLUE) ugh. Bought the white. Almost went to BMW because of that. Interior selection also limited, parchment only with white, no black. They still insist on a 16 gallon tank, way too small considering mileage has been about 21. Always stopping to feel up. Took a small 200 mile trip and still about 22.5. We've never had an issue with an Acura product and love our dealer. Have a 12 TSX and 14 TL SHAWD as well. Love them all. In retrospect tech would have been fine at 3000 less. And yes she would buy again.UPDATE Have now had this vehicle 7 months and still not sure of the tech stuff and not liking most of it. Hard to see buttons and writing on them. Find myself searching all the time. Dual screen is foolish, makes no sense and is distracting while driving and hard to see in sun. Stupid that you cant operate phone book while driving. I guess designers think it's safer to pick up a phone and start searching. My 12 TSX and 14 TL both tech so much more user friendly. Find myself looking for those keys when heading out. Wife can have this thing, doesn't bother her because she ignores tech anyway.",
  "acura_rdx_2016": " Got my 2016 white rdx fwd advance package. With 2 miles on it.. I got a killer deal.. 42k. Out the door.. 2.9% interests. 5 years. 0 down. N free all season floor mates..no one was willing to lower the price but one dealer did.. No up sale no add on. In n out took 2h because the car just arrive on lot.",
  "acura_rdx_2016": " I like the base RDX, but I am gassing every week, when the CRV was every other week.  It's an expensive car that requires expensive up keep. I drive the same miles everyday, actually I am driving 4 miles less since I bought the RDX.  I told my husband I was keeping this car, but I think I am definitely going back to Honda CRV.",
  "acura_rdx_2016": " We expected the RDX to be a great car but it has exceeded all our expectations.  The tech packages work fantastic.  The only issue is it offers so much tech that we keep learning new ways to operate the vehicle.  The car is very quiet, the ride is smooth and the mileage is very good for a new vehicle.  I would recommend the RDX to anyone looking for a smaller vehicle but needs lots of room for riders (I'm 6",
  "acura_rdx_2016": " This is my second RDX.  I had a 2013 Base AWD drive model which was a very nice car but lacked the technology options.Now I have an Advanced AWD and the technology looks promising but disappoints again.  The Nav system has only level of directions no verbose or minimal.  The instructions do not override the radio .  I would like to have the radio go silent so I can hear the instructions. Yes I can turn the instructions off which is nice.The speed limit is not shown (nicer would be if the speed would go red if I above it - either 1 mph or some amount I specify).  The nice folks at Acura could not help me move my addresses from my Garmin to the Acura Nav system.Wonder if Acura will ever truly think through the tech on their cars?",
  "acura_rdx_2016": " Just leased a 2016 Acura RDX AWD Base.  Picked it up on July 31st and have put over 500 miles on it so far.  My purchase rational is comparing my parents Honda CRV EX-L Navigation versus a base RDX.  First and foremost the biggest difference between the CRV and RDX besides the Acura beak is the great 3.5 liter motor which has plenty of kick and power unlike the whiny CVT.  My father loves the great MPG on his CRV but hates the lack of power and secondly he hates the motor and wind noise.  The RDX has great pickup, the exhaust notes are smooth and crisp, and cabin noise is much better than a CRV and equal to my 2011 Lincoln MKZ.  The seats are comfy but the base comes with leatherette which is a little of a bummer, but the leatherette is still much better than the material used in an EX-L Honda.  The base is pretty bare bones and really to get the most bang for your buck the Acura Watch is the best option to choice.  Some standard features like blue ambient lighting,  turn signals, power lift gate, backup camera, keyless entry, push to start ignition, and sunroof are all notable.  The center stack and steering wheel still has way too many buttons. Visibility isn't great out of the back and getting Acura Watch w/ backup sensors would really help.  For a luxury car I would like to have seen backup sensors and blind spot warning standard.  Acura recommends premium fuel and on my first 2 tanks I have gotten 19 MPG average and 22 MPG average, hopefully after breaking in the motor and going for longer highway trips I will average 22-26 MPG.  Steering is good but numb and ride comfort is okay.  The RDX is firmer than I imagined and tends to bounce you around when going over bumps.  Value wise the RDX is hard to recommend over the CRV unless your like myself or my dad who finds the CRV to be noisy and slow and you don't prioritize MPG.  If the lack of power doesn't bother you a cheaper CRV is your bet.Update:  June 2016 I actually sold the car after owning it for about 12 months.  Nothing wrong with the car but downgraded to an ILX due to space, mpg, and the car's eventual lease buyout.  I still stand by the fact that the RDX is the best value for a compact/midsize luxury crossover.  The tried and true 3.5 V6 has a ton of pickup and does 0-60 in about 6 seconds, while still getting 20/28 while smaller four cylinder turbo charged cars such as the Lexus NX get 22/28 mpg.  Moving to an ILX the biggest thing I noticed right away is space, since the RDX has plenty of it, whether your upfront, sitting in the back, or loading the trunk.  Also, the RDX is extremely composed and quiet compared to the ILX.  Uneven pavement, potholes, highway cruising the RDX is almost Lexus quiet.  The thing that I disliked about the RDX the most was that I got the base version so no real leather, no touch screen, no app integration, no safety features like  blind spot or adaptive cruise control, no ventilated front seats or heated rear seats.  Furthermore the RDX was just more car than I needed for grocery duties and weekend driving.  If I had kids, did more highway driving, or lived in a place with more snow or rain than the RDX would have been perfect.  Another great aspect of the RDX is the car's value.  I put maybe 7500 miles on it over 12 months and the car's value was almost $2000 above the lease buy out creating equity.  So if you are looking for a car that holds it value the RDX is great",
  "acura_rdx_2016": " Have had our 2016 RDX with Value package for about 500 miles.  We don't use the Bluetooth (don't talk on the phone while driving), but all the electronics seem great.  Phenomenal stereo system - easily the best we've ever had in a car.  The only real shortcoming is wind noise.  We test drove the vehicle twice and both times it was raining.  Now that we've driven the car for 500 miles I can truly say the wind noise is nothing short of ridiculous.  Yes, I know there is a three layer seal in the doors, but that doesn't stop the wind noise.  I don't know that we've never owned a car with wind noise this bad.  It's totally unacceptable for most cars, but for a car with a sticker price of roughly $43k it is shameful.  Cranking up the stereo is the only way to avoid hearing it all.",
  "acura_rdx_2016": " RDX 2016 Fantastic....New technology features work great....Long time coming but worth the wait....was deciding between Q5...Murano....Sante Fe....Lexus ....The overall cost in comparison to what you get is what convinced me....Although Sante Fe was close....Honda Quality and my Personal History with Honda cars sold me in the end.....Purchased the RDX 2016 with the intent to Drive Cross Country from California to east coast and back.....and wanted and needed the additional technology features ( Acura Watch Plus ) to assist and make my trip comfortable and Safe....I was not disappointed...My only regret is that I should have bought the Advance Package ....oh and it needs more USB Ports especially in the rear Seating areas.",
  "acura_rdx_2016": " Had my new RDX for 22 days and the instrument cluster blew out.  Was driving at night and the dash just went dark.  Got home but once I turned the car off it would not restart.   Just cranked.  No instrument lights, doors would not lock and the rear view camera display would not turn off.   Had vehicle towed to the dealer on July 15 and there it still sits as of July 29.   They replaced the cluster and that did not fix it.  Now they traced it to a wiring harness.   The dash of my new car has been disassembled and will never be the same nor will I ever be able to trust it.   I can already hear all the rattles.  I have owned Honda vehicles for 23 years and never had to have one towed.   Huge disappointment.",
  "acura_rdx_2016": " I downsized from a GMC Yukon Denali for better gas mileage, and wanted a dependable newer car as my 04 was aging.  I am getting better than the 14/miles/gallon but not happy with car at all.  In the first month, already had AC go out during 90+ degree heat.  Was told it was low on freon.  A brand new car low on freon?   The navigation system is beyond frustrating and I end up using my smartphone or my TomTom.  The integrated voice command is not user friendly, despite spending many hours programing and watching videos on youtube as to how to ",
  "acura_rdx_2016": " I just bought mine in June. Love the look! Roomy and smooth ride! I just wish Acura still make V4 with turbo. Still loving it after 1 year.",
  "acura_rdx_2016": " I took delivery a few weeks ago and am very happy with this decision.  I looked hard at the Audi Q5, Lexus F sport, Infiniti Q50, Mercedes ML, Honda CRV, Range Rover Evoque, BMX X3 and Porsche Macan.  When you put them all together and try to evaluate performance, reliability, value, and comfort, the 2016 RDX came out on top.  I look forward to many years with this vehicle.",
  "acura_rdx_2016": "Dashboard layout and overall interior and exterior styling",
  "acura_rdx_2016": "I bought the upgraded aluminum wheels.  Just wish those were included in the Advance package model I purchased",
  "acura_rdx_2016": " Received delivery of our RDX AWD Advanced this past Thursday and have loved every minute with it. Compared to the Lexus NX200t, Land Rover Discovery Sport and Lincoln MKC and found it to be the best driving of the bunch and the best value in themarket. Enjoy all of the technology features, smooth and comfortable drive, great fit and finish and the appealing interior and exterior design. We bought into the high Acura reliability and safety features.",
  "acura_rdx_2016": "The driving dynamics, the touch-screen interface, the seating comfort, in particular the cooling/heated front seats, the quiet and ample from the V6 engine. The interior at full acceleration is very quiet.",
  "acura_rdx_2016": "I think it's a perfect road companion.",
  "acura_rdx_2016": " Bought an RDX Advance model and so far I love it. The nav unit and center console took time to get use to but now a I float with ease. Awesome SUV!!"
}